[
 {
  "index": "aid",
  "name": "Aid",
  "desc": [
   "Your spell bolsters your allies with toughness and resolve. Choose up to three creatures within range. Each target's hit point maximum and current hit points increase by 5 for the duration."
  ],
  "higher_level": [
   "When you cast this spell using a spell slot of 3rd level or higher, a target's hit points increase by an additional 5 for each slot level above 2nd."
  ],
  "range": "30 feet",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A tiny strip of white cloth.",
  "ritual": false,
  "duration": "8 hours",
  "concentration": false,
  "casting_time": "1 action",
  "level": 2,
  "heal_at_slot_level": {
   "2": "5",
   "3": "10",
   "4": "15",
   "5": "20",
   "6": "25",
   "7": "30",
   "8": "35",
   "9": "40"
  },
  "school": {
   "index": "abjuration",
   "name": "Abjuration",
   "url": "/api/magic-schools/abjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "paladin",
    "name": "Paladin",
    "url": "/api/classes/paladin"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/aid"
 },
 {
  "index": "animal-friendship",
  "name": "Animal Friendship",
  "desc": [
   "This spell lets you convince a beast that you mean it no harm. Choose a beast that you can see within range. It must see and hear you. If the beast's Intelligence is 4 or higher, the spell fails. Otherwise, the beast must succeed on a wisdom saving throw or be charmed by you for the spell's duration. If you or one of your companions harms the target, the spells ends."
  ],
  "range": "30 feet",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A morsel of food.",
  "ritual": false,
  "duration": "24 hours",
  "concentration": false,
  "casting_time": "1 action",
  "level": 1,
  "dc": {
   "dc_type": {
    "index": "wis",
    "name": "WIS",
    "url": "/api/ability-scores/wis"
   },
   "dc_success": "none"
  },
  "school": {
   "index": "enchantment",
   "name": "Enchantment",
   "url": "/api/magic-schools/enchantment"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "ranger",
    "name": "Ranger",
    "url": "/api/classes/ranger"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/animal-friendship"
 },
 {
  "index": "animate-dead",
  "name": "Animate Dead",
  "desc": [
   "This spell creates an undead servant. Choose a pile of bones or a corpse of a Medium or Small humanoid within range. Your spell imbues the target with a foul mimicry of life, raising it as an undead creature. The target becomes a skeleton if you chose bones or a zombie if you chose a corpse (the DM has the creature's game statistics).",
   "On each of your turns, you can use a bonus action to mentally command any creature you made with this spell if the creature is within 60 feet of you (if you control multiple creatures, you can command any or all of them at the same time, issuing the same command to each one). You decide what action the creature will take and where it will move during its next turn, or you can issue a general command, such as to guard a particular chamber or corridor. If you issue no commands, the creature only defends itself against hostile creatures. Once given an order, the creature continues to follow it until its task is complete.",
   "The creature is under your control for 24 hours, after which it stops obeying any command you've given it. To maintain control of the creature for another 24 hours, you must cast this spell on the creature again before the current 24-hour period ends. This use of the spell reasserts your control over up to four creatures you have animated with this spell, rather than animating a new one."
  ],
  "higher_level": [
   "When you cast this spell using a spell slot of 4th level or higher, you animate or reassert control over two additional undead creatures for each slot level above 3rd. Each of the creatures must come from a different corpse or pile of bones."
  ],
  "range": "10 feet",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A drop of blood, a piece of flesh, and a pinch of bone dust.",
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 minute",
  "level": 3,
  "school": {
   "index": "necromancy",
   "name": "Necromancy",
   "url": "/api/magic-schools/necromancy"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/animate-dead"
 },
 {
  "index": "antimagic-field",
  "name": "Antimagic Field",
  "desc": [
   "A 10-foot-radius invisible sphere of antimagic surrounds you. This area is divorced from the magical energy that suffuses the multiverse. Within the sphere, spells can't be cast, summoned creatures disappear, and even magic items become mundane. Until the spell ends, the sphere moves with you, centered on you.",
   "Spells and other magical effects, except those created by an artifact or a deity, are suppressed in the sphere and can't protrude into it. A slot expended to cast a suppressed spell is consumed. While an effect is suppressed, it doesn't function, but the time it spends suppressed counts against its duration.",
   "Targeted Effects.",
   "Spells and other magical effects, such as magic missile and charm person, that target a creature or an object in the sphere have no effect on that target.",
   "Areas of Magic.",
   "The area of another spell or magical effect, such as fireball, can't extend into the sphere. If the sphere overlaps an area of magic, the part of the area that is covered by the sphere is suppressed. For example, the flames created by a wall of fire are suppressed within the sphere, creating a gap in the wall if the overlap is large enough.",
   "Spells.",
   "Any active spell or other magical effect on a creature or an object in the sphere is suppressed while the creature or object is in it.",
   "Magic Items.",
   "The properties and powers of magic items are suppressed in the sphere. For example, a +1 longsword in the sphere functions as a nonmagical longsword.",
   "A magic weapon's properties and powers are suppressed if it is used against a target in the sphere or wielded by an attacker in the sphere. If a magic weapon or a piece of magic ammunition fully leaves the sphere (for example, if you fire a magic arrow or throw a magic spear at a target outside the sphere), the magic of the item ceases to be suppressed as soon as it exits.",
   "Magical Travel.",
   "Teleportation and planar travel fail to work in the sphere, whether the sphere is the destination or the departure point for such magical travel. A portal to another location, world, or plane of existence, as well as an opening to an extradimensional space such as that created by the rope trick spell, temporarily closes while in the sphere.",
   "Creatures and Objects.",
   "A creature or object summoned or created by magic temporarily winks out of existence in the sphere. Such a creature instantly reappears once the space the creature occupied is no longer within the sphere.",
   "Dispel Magic.",
   "Spells and magical effects such as dispel magic have no effect on the sphere. Likewise, the spheres created by different antimagic field spells don't nullify each other."
  ],
  "range": "Self",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A pinch of powdered iron or iron filings.",
  "ritual": false,
  "duration": "Up to 1 hour",
  "concentration": true,
  "casting_time": "1 action",
  "level": 8,
  "area_of_effect": {
   "type": "sphere",
   "size": 10
  },
  "school": {
   "index": "abjuration",
   "name": "Abjuration",
   "url": "/api/magic-schools/abjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/antimagic-field"
 },
 {
  "index": "arcane-eye",
  "name": "Arcane Eye",
  "desc": [
   "You create an invisible, magical eye within range that hovers in the air for the duration.",
   "You mentally receive visual information from the eye, which has normal vision and darkvision out to 30 feet. The eye can look in every direction.",
   "As an action, you can move the eye up to 30 feet in any direction. There is no limit to how far away from you the eye can move, but it can't enter another plane of existence. A solid barrier blocks the eye's movement, but the eye can pass through an opening as small as 1 inch in diameter."
  ],
  "range": "30 feet",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A bit of bat fur.",
  "ritual": false,
  "duration": "Up to 1 hour",
  "concentration": true,
  "casting_time": "1 action",
  "level": 4,
  "area_of_effect": {
   "type": "sphere",
   "size": 30
  },
  "school": {
   "index": "divination",
   "name": "Divination",
   "url": "/api/magic-schools/divination"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/arcane-eye"
 },
 {
  "index": "astral-projection",
  "name": "Astral Projection",
  "desc": [
   "You and up to eight willing creatures within range project your astral bodies into the Astral Plane (the spell fails and the casting is wasted if you are already on that plane). The material body you leave behind is unconscious and in a state of suspended animation; it doesn't need food or air and doesn't age.",
   "Your astral body resembles your mortal form in almost every way, replicating your game statistics and possessions. The principal difference is the addition of a silvery cord that extends from between your shoulder blades and trails behind you, fading to invisibility after 1 foot. This cord is your tether to your material body. As long as the tether remains intact, you can find your way home. If the cord is cut--something that can happen only when an effect specifically states that it does--your soul and body are separated, killing you instantly.",
   "Your astral form can freely travel through the Astral Plane and can pass through portals there leading to any other plane. If you enter a new plane or return to the plane you were on when casting this spell, your body and possessions are transported along the silver cord, allowing you to re-enter your body as you enter the new plane. Your astral form is a separate incarnation. Any damage or other effects that apply to it have no effect on your physical body, nor do they persist when you return to it.",
   "The spell ends for you and your companions when you use your action to dismiss it. When the spell ends, the affected creature returns to its physical body, and it awakens.",
   "The spell might also end early for you or one of your companions. A successful dispel magic spell used against an astral or physical body ends the spell for that creature. If a creature's original body or its astral form drops to 0 hit points, the spell ends for that creature. If the spell ends and the silver cord is intact, the cord pulls the creature's astral form back to its body, ending its state of suspended animation.",
   "If you are returned to your body prematurely, your companions remain in their astral forms and must find their own way back to their bodies, usually by dropping to 0 hit points."
  ],
  "range": "10 feet",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "For each creature you affect with this spell, you must provide one jacinth worth at least 1,000gp and one ornately carved bar of silver worth at least 100gp, all of which the spell consumes.",
  "ritual": false,
  "duration": "Special",
  "concentration": false,
  "casting_time": "1 hour",
  "level": 9,
  "school": {
   "index": "necromancy",
   "name": "Necromancy",
   "url": "/api/magic-schools/necromancy"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "warlock",
    "name": "Warlock",
    "url": "/api/classes/warlock"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/astral-projection"
 },
 {
  "index": "augury",
  "name": "Augury",
  "desc": [
   "By casting gem-inlaid sticks, rolling dragon bones, laying out ornate cards, or employing some other divining tool, you receive an omen from an otherworldly entity about the results of a specific course of action that you plan to take within the next 30 minutes. The DM chooses from the following possible omens:",
   "- Weal, for good results",
   "- Woe, for bad results",
   "- Weal and woe, for both good and bad results",
   "- Nothing, for results that aren't especially good or bad",
   "The spell doesn't take into account any possible circumstances that might change the outcome, such as the casting of additional spells or the loss or gain of a companion.",
   "If you cast the spell two or more times before completing your next long rest, there is a cumulative 25 percent chance for each casting after the first that you get a random reading. The DM makes this roll in secret."
  ],
  "range": "Self",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "Specially marked sticks, bones, or similar tokens worth at least 25gp.",
  "ritual": true,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 minute",
  "level": 2,
  "school": {
   "index": "divination",
   "name": "Divination",
   "url": "/api/magic-schools/divination"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/augury"
 },
 {
  "index": "bane",
  "name": "Bane",
  "desc": [
   "Up to three creatures of your choice that you can see within range must make charisma saving throws. Whenever a target that fails this saving throw makes an attack roll or a saving throw before the spell ends, the target must roll a d4 and subtract the number rolled from the attack roll or saving throw."
  ],
  "higher_level": [
   "When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st."
  ],
  "range": "30 feet",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A drop of blood.",
  "ritual": false,
  "duration": "Up to 1 minute",
  "concentration": true,
  "casting_time": "1 action",
  "level": 1,
  "dc": {
   "dc_type": {
    "index": "cha",
    "name": "CHA",
    "url": "/api/ability-scores/cha"
   },
   "dc_success": "none"
  },
  "school": {
   "index": "enchantment",
   "name": "Enchantment",
   "url": "/api/magic-schools/enchantment"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/bane"
 },
 {
  "index": "banishment",
  "name": "Banishment",
  "desc": [
   "You attempt to send one creature that you can see within range to another plane of existence. The target must succeed on a charisma saving throw or be banished.",
   "If the target is native to the plane of existence you're on, you banish the target to a harmless demiplane. While there, the target is incapacitated. The target remains there until the spell ends, at which point the target reappears in the space it left or in the nearest unoccupied space if that space is occupied.",
   "If the target is native to a different plane of existence than the one you're on, the target is banished with a faint popping noise, returning to its home plane. If the spell ends before 1 minute has passed, the target reappears in the space it left or in the nearest unoccupied space if that space is occupied. Otherwise, the target doesn't return."
  ],
  "higher_level": [
   "When you cast this spell using a spell slot of 5th level or higher, you can target one additional creature for each slot level above 4th."
  ],
  "range": "60 feet",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "An item distasteful to the target.",
  "ritual": false,
  "duration": "Up to 1 minute",
  "concentration": true,
  "casting_time": "1 action",
  "level": 4,
  "dc": {
   "dc_type": {
    "index": "cha",
    "name": "CHA",
    "url": "/api/ability-scores/cha"
   },
   "dc_success": "none"
  },
  "school": {
   "index": "abjuration",
   "name": "Abjuration",
   "url": "/api/magic-schools/abjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "paladin",
    "name": "Paladin",
    "url": "/api/classes/paladin"
   },
   {
    "index": "sorcerer",
    "name": "Sorcerer",
    "url": "/api/classes/sorcerer"
   },
   {
    "index": "warlock",
    "name": "Warlock",
    "url": "/api/classes/warlock"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/banishment"
 },
 {
  "index": "beacon-of-hope",
  "name": "Beacon of Hope",
  "desc": [
   "This spell bestows hope and vitality. Choose any number of creatures within range. For the duration, each target has advantage on wisdom saving throws and death saving throws, and regains the maximum number of hit points possible from any healing."
  ],
  "range": "30 feet",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "Up to 1 minute",
  "concentration": true,
  "casting_time": "1 action",
  "level": 3,
  "school": {
   "index": "abjuration",
   "name": "Abjuration",
   "url": "/api/magic-schools/abjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   },
   {
    "index": "life",
    "name": "Life",
    "url": "/api/subclasses/life"
   },
   {
    "index": "devotion",
    "name": "Devotion",
    "url": "/api/subclasses/devotion"
   }
  ],
  "url": "/api/spells/beacon-of-hope"
 },
 {
  "index": "bestow-curse",
  "name": "Bestow Curse",
  "desc": [
   "You touch a creature, and that creature must succeed on a wisdom saving throw or become cursed for the duration of the spell. When you cast this spell, choose the nature of the curse from the following options:",
   "- Choose one ability score. While cursed, the target has disadvantage on ability checks and saving throws made with that ability score.",
   "- While cursed, the target has disadvantage on attack rolls against you.",
   "- While cursed, the target must make a wisdom saving throw at the start of each of its turns. If it fails, it wastes its action that turn doing nothing.",
   "- While the target is cursed, your attacks and spells deal an extra 1d8 necrotic damage to the target.",
   "A remove curse spell ends this effect. At the DM's option, you may choose an alternative curse effect, but it should be no more powerful than those described above. The DM has final say on such a curse's effect."
  ],
  "higher_level": [
   "If you cast this spell using a spell slot of 4th level or higher, the duration is concentration, up to 10 minutes. If you use a spell slot of 5th level or higher, the duration is 8 hours. If you use a spell slot of 7th level or higher, the duration is 24 hours. If you use a 9th level spell slot, the spell lasts until it is dispelled. Using a spell slot of 5th level or higher grants a duration that doesn't require concentration."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "Up to 1 minute",
  "concentration": true,
  "casting_time": "1 action",
  "level": 3,
  "dc": {
   "dc_type": {
    "index": "wis",
    "name": "WIS",
    "url": "/api/ability-scores/wis"
   },
   "dc_success": "none",
   "desc": "On fail, become cursed for the duration of the spell."
  },
  "school": {
   "index": "necromancy",
   "name": "Necromancy",
   "url": "/api/magic-schools/necromancy"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/bestow-curse"
 },
 {
  "index": "blade-barrier",
  "name": "Blade Barrier",
  "desc": [
   "You create a vertical wall of whirling, razor-sharp blades made of magical energy. The wall appears within range and lasts for the duration. You can make a straight wall up to 100 feet long, 20 feet high, and 5 feet thick, or a ringed wall up to 60 feet in diameter, 20 feet high, and 5 feet thick. The wall provides three-quarters cover to creatures behind it, and its space is difficult terrain.",
   "When a creature enters the wall's area for the first time on a turn or starts its turn there, the creature must make a dexterity saving throw. On a failed save, the creature takes 6d10 slashing damage. On a successful save, the creature takes half as much damage."
  ],
  "range": "90 feet",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "Up to 10 minutes",
  "concentration": true,
  "casting_time": "1 action",
  "level": 6,
  "damage": {
   "damage_type": {
    "index": "slashing",
    "name": "Slashing",
    "url": "/api/damage-types/slashing"
   },
   "damage_at_slot_level": {
    "6": "6d10"
   }
  },
  "dc": {
   "dc_type": {
    "index": "dex",
    "name": "DEX",
    "url": "/api/ability-scores/dex"
   },
   "dc_success": "half"
  },
  "area_of_effect": {
   "type": "line",
   "size": 100
  },
  "school": {
   "index": "evocation",
   "name": "Evocation",
   "url": "/api/magic-schools/evocation"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/blade-barrier"
 },
 {
  "index": "bless",
  "name": "Bless",
  "desc": [
   "You bless up to three creatures of your choice within range. Whenever a target makes an attack roll or a saving throw before the spell ends, the target can roll a d4 and add the number rolled to the attack roll or saving throw."
  ],
  "higher_level": [
   "When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st."
  ],
  "range": "30 feet",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A sprinkling of holy water.",
  "ritual": false,
  "duration": "Up to 1 minute",
  "concentration": true,
  "casting_time": "1 action",
  "level": 1,
  "school": {
   "index": "enchantment",
   "name": "Enchantment",
   "url": "/api/magic-schools/enchantment"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "paladin",
    "name": "Paladin",
    "url": "/api/classes/paladin"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   },
   {
    "index": "life",
    "name": "Life",
    "url": "/api/subclasses/life"
   }
  ],
  "url": "/api/spells/bless"
 },
 {
  "index": "blindness-deafness",
  "name": "Blindness/Deafness",
  "desc": [
   "You can blind or deafen a foe. Choose one creature that you can see within range to make a constitution saving throw. If it fails, the target is either blinded or deafened (your choice) for the duration. At the end of each of its turns, the target can make a constitution saving throw. On a success, the spell ends."
  ],
  "higher_level": [
   "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd."
  ],
  "range": "30 feet",
  "components": [
   "V"
  ],
  "ritual": false,
  "duration": "1 minute",
  "concentration": false,
  "casting_time": "1 action",
  "level": 2,
  "dc": {
   "dc_type": {
    "index": "con",
    "name": "CON",
    "url": "/api/ability-scores/con"
   },
   "dc_success": "none"
  },
  "school": {
   "index": "necromancy",
   "name": "Necromancy",
   "url": "/api/magic-schools/necromancy"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "sorcerer",
    "name": "Sorcerer",
    "url": "/api/classes/sorcerer"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   },
   {
    "index": "fiend",
    "name": "Fiend",
    "url": "/api/subclasses/fiend"
   }
  ],
  "url": "/api/spells/blindness-deafness"
 },
 {
  "index": "calm-emotions",
  "name": "Calm Emotions",
  "desc": [
   "You attempt to suppress strong emotions in a group of people. Each humanoid in a 20-foot-radius sphere centered on a point you choose within range must make a charisma saving throw; a creature can choose to fail this saving throw if it wishes. If a creature fails its saving throw, choose one of the following two effects. You can suppress any effect causing a target to be charmed or frightened. When this spell ends, any suppressed effect resumes, provided that its duration has not expired in the meantime.",
   "Alternatively, you can make a target indifferent about creatures of your choice that it is hostile toward. This indifference ends if the target is attacked or harmed by a spell or if it witnesses any of its friends being harmed. When the spell ends, the creature becomes hostile again, unless the DM rules otherwise."
  ],
  "range": "60 feet",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "Up to 1 minute",
  "concentration": true,
  "casting_time": "1 action",
  "level": 2,
  "dc": {
   "dc_type": {
    "index": "cha",
    "name": "CHA",
    "url": "/api/ability-scores/cha"
   },
   "dc_success": "none"
  },
  "area_of_effect": {
   "type": "sphere",
   "size": 20
  },
  "school": {
   "index": "enchantment",
   "name": "Enchantment",
   "url": "/api/magic-schools/enchantment"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/calm-emotions"
 },
 {
  "index": "clairvoyance",
  "name": "Clairvoyance",
  "desc": [
   "You create an invisible sensor within range in a location familiar to you (a place you have visited or seen before) or in an obvious location that is unfamiliar to you (such as behind a door, around a corner, or in a grove of trees). The sensor remains in place for the duration, and it can't be attacked or otherwise interacted with.",
   "When you cast the spell, you choose seeing or hearing. You can use the chosen sense through the sensor as if you were in its space. As your action, you can switch between seeing and hearing.",
   "A creature that can see the sensor (such as a creature benefiting from see invisibility or truesight) sees a luminous, intangible orb about the size of your fist."
  ],
  "range": "1 mile",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A focus worth at least 100gp, either a jeweled horn for hearing or a glass eye for seeing.",
  "ritual": false,
  "duration": "Up to 10 minutes",
  "concentration": true,
  "casting_time": "10 minutes",
  "level": 3,
  "school": {
   "index": "divination",
   "name": "Divination",
   "url": "/api/magic-schools/divination"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "sorcerer",
    "name": "Sorcerer",
    "url": "/api/classes/sorcerer"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/clairvoyance"
 },
 {
  "index": "command",
  "name": "Command",
  "desc": [
   "You speak a one-word command to a creature you can see within range. The target must succeed on a wisdom saving throw or follow the command on its next turn. The spell has no effect if the target is undead, if it doesn't understand your language, or if your command is directly harmful to it.",
   "Some typical commands and their effects follow. You might issue a command other than one described here. If you do so, the DM determines how the target behaves. If the target can't follow your command, the spell ends.",
   "Approach.",
   "The target moves toward you by the shortest and most direct route, ending its turn if it moves within 5 feet of you.",
   "Drop",
   "The target drops whatever it is holding and then ends its turn.",
   "Flee.",
   "The target spends its turn moving away from you by the fastest available means.",
   "Grovel.",
   "The target falls prone and then ends its turn.",
   "Halt.",
   "The target doesn't move and takes no actions. A flying creature stays aloft, provided that it is able to do so. If it must move to stay aloft, it flies the minimum distance needed to remain in the air."
  ],
  "higher_level": [
   "When you cast this spell using a spell slot of 2nd level or higher, you can affect one additional creature for each slot level above 1st. The creatures must be within 30 feet of each other when you target them."
  ],
  "range": "60 feet",
  "components": [
   "V"
  ],
  "ritual": false,
  "duration": "1 round",
  "concentration": false,
  "casting_time": "1 action",
  "level": 1,
  "dc": {
   "dc_type": {
    "index": "wis",
    "name": "WIS",
    "url": "/api/ability-scores/wis"
   },
   "dc_success": "none"
  },
  "school": {
   "index": "enchantment",
   "name": "Enchantment",
   "url": "/api/magic-schools/enchantment"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "paladin",
    "name": "Paladin",
    "url": "/api/classes/paladin"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   },
   {
    "index": "fiend",
    "name": "Fiend",
    "url": "/api/subclasses/fiend"
   }
  ],
  "url": "/api/spells/command"
 },
 {
  "index": "commune",
  "name": "Commune",
  "desc": [
   "You contact your deity or a divine proxy and ask up to three questions that can be answered with a yes or no. You must ask your questions before the spell ends. You receive a correct answer for each question.",
   "Divine beings aren't necessarily omniscient, so you might receive \"unclear\" as an answer if a question pertains to information that lies beyond the deity's knowledge. In a case where a one-word answer could be misleading or contrary to the deity's interests, the DM might offer a short phrase as an answer instead.",
   "If you cast the spell two or more times before finishing your next long rest, there is a cumulative 25 percent chance for each casting after the first that you get no answer. The DM makes this roll in secret."
  ],
  "range": "Self",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "Incense and a vial of holy or unholy water.",
  "ritual": true,
  "duration": "1 minute",
  "concentration": false,
  "casting_time": "1 minute",
  "level": 5,
  "school": {
   "index": "divination",
   "name": "Divination",
   "url": "/api/magic-schools/divination"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [
   {
    "index": "devotion",
    "name": "Devotion",
    "url": "/api/subclasses/devotion"
   }
  ],
  "url": "/api/spells/commune"
 },
 {
  "index": "conjure-celestial",
  "name": "Conjure Celestial",
  "desc": [
   "You summon a celestial of challenge rating 4 or lower, which appears in an unoccupied space that you can see within range. The celestial disappears when it drops to 0 hit points or when the spell ends.",
   "The celestial is friendly to you and your companions for the duration. Roll initiative for the celestial, which has its own turns. It obeys any verbal commands that you issue to it (no action required by you), as long as they don't violate its alignment. If you don't issue any commands to the celestial, it defends itself from hostile creatures but otherwise takes no actions.",
   "The DM has the celestial's statistics."
  ],
  "higher_level": [
   "When you cast this spell using a 9th-level spell slot, you summon a celestial of challenge rating 5 or lower."
  ],
  "range": "90 feet",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "Up to 1 hour",
  "concentration": true,
  "casting_time": "1 minute",
  "level": 7,
  "school": {
   "index": "conjuration",
   "name": "Conjuration",
   "url": "/api/magic-schools/conjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/conjure-celestial"
 },
 {
  "index": "contagion",
  "name": "Contagion",
  "desc": [
   "Your touch inflicts disease. Make a melee spell attack against a creature within your reach. On a hit, you afflict the creature with a disease of your choice from any of the ones described below.",
   "At the end of each of the target's turns, it must make a constitution saving throw. After failing three of these saving throws, the disease's effects last for the duration, and the creature stops making these saves. After succeeding on three of these saving throws, the creature recovers from the disease, and the spell ends.",
   "Since this spell induces a natural disease in its target, any effect that removes a disease or otherwise ameliorates a disease's effects apply to it.",
   "Blinding Sickness.",
   "Pain grips the creature's mind, and its eyes turn milky white. The creature has disadvantage on wisdom checks and wisdom saving throws and is blinded.",
   "Filth Fever.",
   "A raging fever sweeps through the creature's body. The creature has disadvantage on strength checks, strength saving throws, and attack rolls that use Strength.",
   "Flesh Rot.",
   "The creature's flesh decays. The creature has disadvantage on Charisma checks and vulnerability to all damage.",
   "Mindfire.",
   "The creature's mind becomes feverish. The creature has disadvantage on intelligence checks and intelligence saving throws, and the creature behaves as if under the effects of the confusion spell during combat.",
   "Seizure.",
   "The creature is overcome with shaking. The creature has disadvantage on dexterity checks, dexterity saving throws, and attack rolls that use Dexterity.",
   "Slimy Doom.",
   "The creature begins to bleed uncontrollably. The creature has disadvantage on constitution checks and constitution saving throws. In addition, whenever the creature takes damage, it is stunned until the end of its next turn."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "7 days",
  "concentration": false,
  "casting_time": "1 action",
  "level": 5,
  "attack_type": "melee",
  "dc": {
   "dc_type": {
    "index": "con",
    "name": "CON",
    "url": "/api/ability-scores/con"
   },
   "dc_success": "other",
   "desc": "After succeeding on three of these saving throws, the creature recovers from the disease, and the spell ends."
  },
  "school": {
   "index": "necromancy",
   "name": "Necromancy",
   "url": "/api/magic-schools/necromancy"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/contagion"
 },
 {
  "index": "continual-flame",
  "name": "Continual Flame",
  "desc": [
   "A flame, equivalent in brightness to a torch, springs forth from an object that you touch. The effect looks like a regular flame, but it creates no heat and doesn't use oxygen. A continual flame can be covered or hidden but not smothered or quenched."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "Ruby dust worth 50 gp, which the spell consumes.",
  "ritual": false,
  "duration": "Until dispelled",
  "concentration": false,
  "casting_time": "1 action",
  "level": 2,
  "school": {
   "index": "evocation",
   "name": "Evocation",
   "url": "/api/magic-schools/evocation"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/continual-flame"
 },
 {
  "index": "control-water",
  "name": "Control Water",
  "desc": [
   "Until the spell ends, you control any freestanding water inside an area you choose that is a cube up to 100 feet on a side. You can choose from any of the following effects when you cast this spell. As an action on your turn, you can repeat the same effect or choose a different one.",
   "Flood.",
   "You cause the water level of all standing water in the area to rise by as much as 20 feet. If the area includes a shore, the flooding water spills over onto dry land.",
   "instead create a 20-foot tall wave that travels from one side of the area to the other and then crashes down. Any Huge or smaller vehicles in the wave's path are carried with it to the other side. Any Huge or smaller vehicles struck by the wave have a 25 percent chance of capsizing.",
   "The water level remains elevated until the spell ends or you choose a different effect. If this effect produced a wave, the wave repeats on the start of your next turn while the flood effect lasts.",
   "Part Water.",
   "You cause water in the area to move apart and create a trench. The trench extends across the spell's area, and the separated water forms a wall to either side. The trench remains until the spell ends or you choose a different effect. The water then slowly fills in the trench over the course of the next round until the normal water level is restored.",
   "Redirect Flow.",
   "You cause flowing water in the area to move in a direction you choose, even if the water has to flow over obstacles, up walls, or in other unlikely directions. The water in the area moves as you direct it, but once it moves beyond the spell's area, it resumes its flow based on the terrain conditions. The water continues to move in the direction you chose until the spell ends or you choose a different effect.",
   "Whirlpool.",
   "This effect requires a body of water at least 50 feet square and 25 feet deep. You cause a whirlpool to form in the center of the area. The whirlpool forms a vortex that is 5 feet wide at the base, up to 50 feet wide at the top, and 25 feet tall. Any creature or object in the water and within 25 feet of the vortex is pulled 10 feet toward it. A creature can swim away from the vortex by making a Strength (Athletics) check against your spell save DC.",
   "When a creature enters the vortex for the first time on a turn or starts its turn there, it must make a strength saving throw. On a failed save, the creature takes 2d8 bludgeoning damage and is caught in the vortex until the spell ends. On a successful save, the creature takes half damage, and isn't caught in the vortex. A creature caught in the vortex can use its action to try to swim away from the vortex as described above, but has disadvantage on the Strength (Athletics) check to do so.",
   "The first time each turn that an object enters the vortex, the object takes 2d8 bludgeoning damage; this damage occurs each round it remains in the vortex."
  ],
  "range": "300 feet",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A drop of water and a pinch of dust.",
  "ritual": false,
  "duration": "Up to 10 minutes",
  "concentration": true,
  "casting_time": "1 action",
  "level": 4,
  "damage": {
   "damage_type": {
    "index": "bludgeoning",
    "name": "Bludgeoning",
    "url": "/api/damage-types/bludgeoning"
   },
   "damage_at_slot_level": {
    "4": "2d8"
   }
  },
  "dc": {
   "dc_type": {
    "index": "str",
    "name": "STR",
    "url": "/api/ability-scores/str"
   },
   "dc_success": "half"
  },
  "area_of_effect": {
   "type": "cube",
   "size": 100
  },
  "school": {
   "index": "transmutation",
   "name": "Transmutation",
   "url": "/api/magic-schools/transmutation"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/control-water"
 },
 {
  "index": "control-weather",
  "name": "Control Weather",
  "desc": [
   "You take control of the weather within 5 miles of you for the duration. You must be outdoors to cast this spell. Moving to a place where you don't have a clear path to the sky ends the spell early.",
   "When you cast the spell, you change the current weather conditions, which are determined by the DM based on the climate and season. You can change precipitation, temperature, and wind. It takes 1d4 × 10 minutes for the new conditions to take effect. Once they do so, you can change the conditions again. When the spell ends, the weather gradually returns to normal.",
   "When you change the weather conditions, find a current condition on the following tables and change its stage by one, up or down. When changing the wind, you can change its direction."
  ],
  "range": "Self",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "Burning incense and bits of earth and wood mixed in water.",
  "ritual": false,
  "duration": "Up to 8 hours",
  "concentration": true,
  "casting_time": "10 minutes",
  "level": 8,
  "school": {
   "index": "transmutation",
   "name": "Transmutation",
   "url": "/api/magic-schools/transmutation"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [
   {
    "index": "land",
    "name": "Land",
    "url": "/api/subclasses/land"
   }
  ],
  "url": "/api/spells/control-weather"
 },
 {
  "index": "create-food-and-water",
  "name": "Create Food and Water",
  "desc": [
   "You create 45 pounds of food and 30 gallons of water on the ground or in containers within range, enough to sustain up to fifteen humanoids or five steeds for 24 hours. The food is bland but nourishing, and spoils if uneaten after 24 hours. The water is clean and doesn't go bad."
  ],
  "range": "30 feet",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 action",
  "level": 3,
  "school": {
   "index": "conjuration",
   "name": "Conjuration",
   "url": "/api/magic-schools/conjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "paladin",
    "name": "Paladin",
    "url": "/api/classes/paladin"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   },
   {
    "index": "land",
    "name": "Land",
    "url": "/api/subclasses/land"
   }
  ],
  "url": "/api/spells/create-food-and-water"
 },
 {
  "index": "create-or-destroy-water",
  "name": "Create or Destroy Water",
  "desc": [
   "You either create or destroy water.",
   "Create Water.",
   "You create up to 10 gallons of clean water within range in an open container. Alternatively, the water falls as rain in a 30-foot cube within range.",
   "Destroy Water.",
   "You destroy up to 10 gallons of water in an open container within range. Alternatively, you destroy fog in a 30-foot cube within range."
  ],
  "higher_level": [
   "When you cast this spell using a spell slot of 2nd level or higher, you create or destroy 10 additional gallons of water, or the size of the cube increases by 5 feet, for each slot level above 1st."
  ],
  "range": "30 feet",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A drop of water if creating water, or a few grains of sand if destroying it.",
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 action",
  "level": 1,
  "area_of_effect": {
   "type": "cube",
   "size": 30
  },
  "school": {
   "index": "transmutation",
   "name": "Transmutation",
   "url": "/api/magic-schools/transmutation"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/create-or-destroy-water"
 },
 {
  "index": "create-undead",
  "name": "Create Undead",
  "desc": [
   "You can cast this spell only at night. Choose up to three corpses of Medium or Small humanoids within range. Each corpse becomes a ghoul under your control. (The DM has game statistics for these creatures.)",
   "As a bonus action on each of your turns, you can mentally command any creature you animated with this spell if the creature is within 120 feet of you (if you control multiple creatures, you can command any or all of them at the same time, issuing the same command to each one). You decide what action the creature will take and where it will move during its next turn, or you can issue a general command, such as to guard a particular chamber or corridor. If you issue no commands, the creature only defends itself against hostile creatures. Once given an order, the creature continues to follow it until its task is complete.",
   "The creature is under your control for 24 hours, after which it stops obeying any command you have given it. To maintain control of the creature for another 24 hours, you must cast this spell on the creature before the current 24-hour period ends. This use of the spell reasserts your control over up to three creatures you have animated with this spell, rather than animating new ones."
  ],
  "higher_level": [
   "When you cast this spell using a 7th-level spell slot, you can animate or reassert control over four ghouls. When you cast this spell using an 8th-level spell slot, you can animate or reassert control over five ghouls or two ghasts or wights. When you cast this spell using a 9th-level spell slot, you can animate or reassert control over six ghouls, three ghasts or wights, or two mummies."
  ],
  "range": "10 feet",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "One clay pot filled with grave dirt, one clay pot filled with brackish water, and one 150 gp black onyx stone for each corpse.",
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 minute",
  "level": 6,
  "school": {
   "index": "necromancy",
   "name": "Necromancy",
   "url": "/api/magic-schools/necromancy"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "warlock",
    "name": "Warlock",
    "url": "/api/classes/warlock"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/create-undead"
 },
 {
  "index": "cure-wounds",
  "name": "Cure Wounds",
  "desc": [
   "A creature you touch regains a number of hit points equal to 1d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs."
  ],
  "higher_level": [
   "When you cast this spell using a spell slot of 2nd level or higher, the healing increases by 1d8 for each slot level above 1st."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 action",
  "level": 1,
  "heal_at_slot_level": {
   "1": "1d8 + MOD",
   "2": "2d8 + MOD",
   "3": "3d8 + MOD",
   "4": "4d8 + MOD",
   "5": "5d8 + MOD",
   "6": "6d8 + MOD",
   "7": "7d8 + MOD",
   "8": "8d8 + MOD",
   "9": "9d8 + MOD"
  },
  "school": {
   "index": "evocation",
   "name": "Evocation",
   "url": "/api/magic-schools/evocation"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "paladin",
    "name": "Paladin",
    "url": "/api/classes/paladin"
   },
   {
    "index": "ranger",
    "name": "Ranger",
    "url": "/api/classes/ranger"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   },
   {
    "index": "life",
    "name": "Life",
    "url": "/api/subclasses/life"
   }
  ],
  "url": "/api/spells/cure-wounds"
 },
 {
  "index": "daylight",
  "name": "Daylight",
  "desc": [
   "A 60-foot-radius sphere of light spreads out from a point you choose within range. The sphere is bright light and sheds dim light for an additional 60 feet.",
   "If you chose a point on an object you are holding or one that isn't being worn or carried, the light shines from the object and moves with it. Completely covering the affected object with an opaque object, such as a bowl or a helm, blocks the light.",
   "If any of this spell's area overlaps with an area of darkness created by a spell of 3rd level or lower, the spell that created the darkness is dispelled."
  ],
  "range": "60 feet",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "1 hour",
  "concentration": false,
  "casting_time": "1 action",
  "level": 3,
  "area_of_effect": {
   "type": "sphere",
   "size": 60
  },
  "school": {
   "index": "evocation",
   "name": "Evocation",
   "url": "/api/magic-schools/evocation"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "paladin",
    "name": "Paladin",
    "url": "/api/classes/paladin"
   },
   {
    "index": "ranger",
    "name": "Ranger",
    "url": "/api/classes/ranger"
   },
   {
    "index": "sorcerer",
    "name": "Sorcerer",
    "url": "/api/classes/sorcerer"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   },
   {
    "index": "land",
    "name": "Land",
    "url": "/api/subclasses/land"
   }
  ],
  "url": "/api/spells/daylight"
 },
 {
  "index": "death-ward",
  "name": "Death Ward",
  "desc": [
   "You touch a creature and grant it a measure of protection from death.",
   "The first time the target would drop to 0 hit points as a result of taking damage, the target instead drops to 1 hit point, and the spell ends.",
   "If the spell is still in effect when the target is subjected to an effect that would kill it instantaneously without dealing damage, that effect is instead negated against the target, and the spell ends."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "8 hours",
  "concentration": false,
  "casting_time": "1 action",
  "level": 4,
  "school": {
   "index": "abjuration",
   "name": "Abjuration",
   "url": "/api/magic-schools/abjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "paladin",
    "name": "Paladin",
    "url": "/api/classes/paladin"
   }
  ],
  "subclasses": [
   {
    "index": "life",
    "name": "Life",
    "url": "/api/subclasses/life"
   }
  ],
  "url": "/api/spells/death-ward"
 },
 {
  "index": "detect-evil-and-good",
  "name": "Detect Evil and Good",
  "desc": [
   "For the duration, you know if there is an aberration, celestial, elemental, fey, fiend, or undead within 30 feet of you, as well as where the creature is located. Similarly, you know if there is a place or object within 30 feet of you that has been magically consecrated or desecrated.",
   "The spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt."
  ],
  "range": "Self",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "Up to 10 minutes",
  "concentration": true,
  "casting_time": "1 action",
  "level": 1,
  "area_of_effect": {
   "type": "sphere",
   "size": 30
  },
  "school": {
   "index": "divination",
   "name": "Divination",
   "url": "/api/magic-schools/divination"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "paladin",
    "name": "Paladin",
    "url": "/api/classes/paladin"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/detect-evil-and-good"
 },
 {
  "index": "detect-magic",
  "name": "Detect Magic",
  "desc": [
   "For the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any.",
   "The spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt."
  ],
  "range": "Self",
  "components": [
   "V",
   "S"
  ],
  "ritual": true,
  "duration": "Up to 10 minutes",
  "concentration": true,
  "casting_time": "1 action",
  "level": 1,
  "area_of_effect": {
   "type": "sphere",
   "size": 30
  },
  "school": {
   "index": "divination",
   "name": "Divination",
   "url": "/api/magic-schools/divination"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "paladin",
    "name": "Paladin",
    "url": "/api/classes/paladin"
   },
   {
    "index": "ranger",
    "name": "Ranger",
    "url": "/api/classes/ranger"
   },
   {
    "index": "sorcerer",
    "name": "Sorcerer",
    "url": "/api/classes/sorcerer"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/detect-magic"
 },
 {
  "index": "detect-poison-and-disease",
  "name": "Detect Poison and Disease",
  "desc": [
   "For the duration, you can sense the presence and location of poisons, poisonous creatures, and diseases within 30 feet of you. You also identify the kind of poison, poisonous creature, or disease in each case.",
   "The spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt."
  ],
  "range": "Self",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A yew leaf.",
  "ritual": true,
  "duration": "Up to 10 minutes",
  "concentration": true,
  "casting_time": "1 action",
  "level": 1,
  "area_of_effect": {
   "type": "sphere",
   "size": 30
  },
  "school": {
   "index": "divination",
   "name": "Divination",
   "url": "/api/magic-schools/divination"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "paladin",
    "name": "Paladin",
    "url": "/api/classes/paladin"
   },
   {
    "index": "ranger",
    "name": "Ranger",
    "url": "/api/classes/ranger"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/detect-poison-and-disease"
 },
 {
  "index": "dispel-evil-and-good",
  "name": "Dispel Evil and Good",
  "desc": [
   "Shimmering energy surrounds and protects you from fey, undead, and creatures originating from beyond the Material Plane. For the duration, celestials, elementals, fey, fiends, and undead have disadvantage on attack rolls against you.",
   "You can end the spell early by using either of the following special functions.",
   "Break Enchantment.",
   "As your action, you touch a creature you can reach that is charmed, frightened, or possessed by a celestial, an elemental, a fey, a fiend, or an undead. The creature you touch is no longer charmed, frightened, or possessed by such creatures.",
   "Dismissal.",
   "As your action, make a melee spell attack against a celestial, an elemental, a fey, a fiend, or an undead you can reach. On a hit, you attempt to drive the creature back to its home plane. The creature must succeed on a charisma saving throw or be sent back to its home plane (if it isn't there already). If they aren't on their home plane, undead are sent to the Shadowfell, and fey are sent to the Feywild."
  ],
  "range": "Self",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "Holy water or powdered silver and iron.",
  "ritual": false,
  "duration": "Up to 1 minute",
  "concentration": true,
  "casting_time": "1 action",
  "level": 5,
  "dc": {
   "dc_type": {
    "index": "cha",
    "name": "CHA",
    "url": "/api/ability-scores/cha"
   },
   "dc_success": "other",
   "desc": "The creature must succeed on a charisma saving throw or be sent back to its home plane (if it isn't there already)"
  },
  "school": {
   "index": "abjuration",
   "name": "Abjuration",
   "url": "/api/magic-schools/abjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "paladin",
    "name": "Paladin",
    "url": "/api/classes/paladin"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/dispel-evil-and-good"
 },
 {
  "index": "dispel-magic",
  "name": "Dispel Magic",
  "desc": [
   "Choose one creature, object, or magical effect within range. Any spell of 3rd level or lower on the target ends. For each spell of 4th level or higher on the target, make an ability check using your spellcasting ability. The DC equals 10 + the spell's level. On a successful check, the spell ends."
  ],
  "higher_level": [
   "When you cast this spell using a spell slot of 4th level or higher, you automatically end the effects of a spell on the target if the spell's level is equal to or less than the level of the spell slot you used."
  ],
  "range": "120 feet",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 action",
  "level": 3,
  "school": {
   "index": "abjuration",
   "name": "Abjuration",
   "url": "/api/magic-schools/abjuration"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "paladin",
    "name": "Paladin",
    "url": "/api/classes/paladin"
   },
   {
    "index": "sorcerer",
    "name": "Sorcerer",
    "url": "/api/classes/sorcerer"
   },
   {
    "index": "warlock",
    "name": "Warlock",
    "url": "/api/classes/warlock"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   },
   {
    "index": "devotion",
    "name": "Devotion",
    "url": "/api/subclasses/devotion"
   }
  ],
  "url": "/api/spells/dispel-magic"
 },
 {
  "index": "divine-word",
  "name": "Divine Word",
  "desc": [
   "You speak a word of God, full of the power that has shaped the world at the dawn of creation. Choose as many creatures as you want from those you see, in the range of the spell. Every creature that hears you must make a backup Charisma, or she undergoes an effect based on the current value of his life.",
   "- pv or less 50: muted for 1 minute",
   "- 40 hp or less: deafened and blinded for 10 minutes",
   "- 30 hp or less: blinded, deafened and dazed for 1 hour",
   "- 20 hp or less: killed instantly",
   "Regardless of its points of current life, a celestial, an elementary, a fairy or a fiend who fails his roll is returned to its original plan (if not already) and it can not go back on your plan for 24 hours, regardless of the means, with the exception of the wish spell."
  ],
  "range": "30 feet",
  "components": [
   "V"
  ],
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 bonus action",
  "level": 7,
  "dc": {
   "dc_type": {
    "index": "cha",
    "name": "CHA",
    "url": "/api/ability-scores/cha"
   },
   "dc_success": "none",
   "desc": "Every creature that hears you must make a backup Charisma, or she undergoes an effect based on the current value of his life. [50 hp or less: muted for 1 minute] [40 hp or less: deafened and blinded for 10 minutes [30 hp or less: blinded, deafened and dazed for 1 hour] [20 hp or less: killed instantly]"
  },
  "school": {
   "index": "evocation",
   "name": "Evocation",
   "url": "/api/magic-schools/evocation"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/divine-word"
 },
 {
  "index": "earthquake",
  "name": "Earthquake",
  "desc": [
   "You create a seismic disturbance at a point on the ground that you can see within range. For the duration, an intense tremor rips through the ground in a 100-foot-radius circle centered on that point and shakes creatures and structures in contact with the ground in that area.",
   "The ground in the area becomes difficult terrain. Each creature on the ground that is concentrating must make a constitution saving throw. On a failed save, the creature's concentration is broken.",
   "When you cast this spell and at the end of each turn you spend concentrating on it, each creature on the ground in the area must make a dexterity saving throw. On a failed save, the creature is knocked prone.",
   "This spell can have additional effects depending on the terrain in the area, as determined by the DM.",
   "Fissures. Fissures open throughout the spell's area at the start of your next turn after you cast the spell. A total of 1d6 such fissures open in locations chosen by the DM. Each is 1d10 × 10 feet deep, 10 feet wide, and extends from one edge of the spell's area to the opposite side. A creature standing on a spot where a fissure opens must succeed on a dexterity saving throw or fall in. A creature that successfully saves moves with the fissure's edge as it opens.",
   "A fissure that opens beneath a structure causes it to automatically collapse (see below).",
   "Structures. The tremor deals 50 bludgeoning damage to any structure in contact with the ground in the area when you cast the spell and at the start of each of your turns until the spell ends. If a structure drops to 0 hit points, it collapses and potentially damages nearby creatures. A creature within half the distance of a structure's height must make a dexterity saving throw. On a failed save, the creature takes 5d6 bludgeoning damage, is knocked prone, and is buried in the rubble, requiring a DC 20 Strength (Athletics) check as an action to escape. The DM can adjust the DC higher or lower, depending on the nature of the rubble. On a successful save, the creature takes half as much damage and doesn't fall prone or become buried."
  ],
  "range": "500 feet",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A pinch of dirt, a piece of rock, and a lump of clay.",
  "ritual": false,
  "duration": "Up to 1 minute",
  "concentration": true,
  "casting_time": "1 action",
  "level": 8,
  "area_of_effect": {
   "type": "sphere",
   "size": 100
  },
  "school": {
   "index": "evocation",
   "name": "Evocation",
   "url": "/api/magic-schools/evocation"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "sorcerer",
    "name": "Sorcerer",
    "url": "/api/classes/sorcerer"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/earthquake"
 },
 {
  "index": "enhance-ability",
  "name": "Enhance Ability",
  "desc": [
   "You touch a creature and bestow upon it a magical enhancement. Choose one of the following effects; the target gains that effect until the spell ends.",
   "Bear's Endurance.",
   "The target has advantage on constitution checks. It also gains 2d6 temporary hit points, which are lost when the spell ends.",
   "Bull's Strength.",
   "The target has advantage on strength checks, and his or her carrying capacity doubles.",
   "Cat's Grace.",
   "The target has advantage on dexterity checks. It also doesn't take damage from falling 20 feet or less if it isn't incapacitated.",
   "Eagle's Splendor.",
   "The target has advantage on Charisma checks.",
   "Fox's Cunning.",
   "The target has advantage on intelligence checks.",
   "Owl's Wisdom.",
   "The target has advantage on wisdom checks."
  ],
  "higher_level": [
   "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "Fur or a feather from a beast.",
  "ritual": false,
  "duration": "Up to 1 hour",
  "concentration": true,
  "casting_time": "1 action",
  "level": 2,
  "school": {
   "index": "transmutation",
   "name": "Transmutation",
   "url": "/api/magic-schools/transmutation"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "sorcerer",
    "name": "Sorcerer",
    "url": "/api/classes/sorcerer"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/enhance-ability"
 },
 {
  "index": "etherealness",
  "name": "Etherealness",
  "desc": [
   "You step into the border regions of the Ethereal Plane, in the area where it overlaps with your current plane. You remain in the Border Ethereal for the duration or until you use your action to dismiss the spell. During this time, you can move in any direction. If you move up or down, every foot of movement costs an extra foot. You can see and hear the plane you originated from, but everything there looks gray, and you can't see anything more than 60 feet away.",
   "While on the Ethereal Plane, you can only affect and be affected by other creatures on that plane. Creatures that aren't on the Ethereal Plane can't perceive you and can't interact with you, unless a special ability or magic has given them the ability to do so.",
   "You ignore all objects and effects that aren't on the Ethereal Plane, allowing you to move through objects you perceive on the plane you originated from.",
   "When the spell ends, you immediately return to the plane you originated from in the spot you currently occupy. If you occupy the same spot as a solid object or creature when this happens, you are immediately shunted to the nearest unoccupied space that you can occupy and take force damage equal to twice the number of feet you are moved.",
   "This spell has no effect if you cast it while you are on the Ethereal Plane or a plane that doesn't border it, such as one of the Outer Planes."
  ],
  "higher_level": [
   "When you cast this spell using a spell slot of 8th level or higher, you can target up to three willing creatures (including you) for each slot level above 7th. The creatures must be within 10 feet of you when you cast the spell."
  ],
  "range": "Self",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "8 hours",
  "concentration": false,
  "casting_time": "1 action",
  "level": 7,
  "school": {
   "index": "transmutation",
   "name": "Transmutation",
   "url": "/api/magic-schools/transmutation"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "sorcerer",
    "name": "Sorcerer",
    "url": "/api/classes/sorcerer"
   },
   {
    "index": "warlock",
    "name": "Warlock",
    "url": "/api/classes/warlock"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/etherealness"
 },
 {
  "index": "find-the-path",
  "name": "Find the Path",
  "desc": [
   "This spell allows you to find the shortest, most direct physical route to a specific fixed location that you are familiar with on the same plane of existence. If you name a destination on another plane of existence, a destination that moves (such as a mobile fortress), or a destination that isn't specific (such as \"a green dragon's lair\"), the spell fails.",
   "For the duration, as long as you are on the same plane of existence as the destination, you know how far it is and in what direction it lies. While you are traveling there, whenever you are presented with a choice of paths along the way, you automatically determine which path is the shortest and most direct route (but not necessarily the safest route) to the destination."
  ],
  "range": "Self",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A set of divinatory tools--such as bones, ivory sticks, cards, teeth, or carved runes--worth 100gp and an object from the location you wish to find.",
  "ritual": false,
  "duration": "Up to 24 hours",
  "concentration": true,
  "casting_time": "1 minute",
  "level": 6,
  "school": {
   "index": "divination",
   "name": "Divination",
   "url": "/api/magic-schools/divination"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/find-the-path"
 },
 {
  "index": "find-traps",
  "name": "Find Traps",
  "desc": [
   "You sense the presence of any trap within range that is within line of sight. A trap, for the purpose of this spell, includes anything that would inflict a sudden or unexpected effect you consider harmful or undesirable, which was specifically intended as such by its creator. Thus, the spell would sense an area affected by the alarm spell, a glyph of warding, or a mechanical pit trap, but it would not reveal a natural weakness in the floor, an unstable ceiling, or a hidden sinkhole.",
   "This spell merely reveals that a trap is present. You don't learn the location of each trap, but you do learn the general nature of the danger posed by a trap you sense."
  ],
  "range": "120 feet",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 action",
  "level": 2,
  "school": {
   "index": "divination",
   "name": "Divination",
   "url": "/api/magic-schools/divination"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "ranger",
    "name": "Ranger",
    "url": "/api/classes/ranger"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/find-traps"
 },
 {
  "index": "fire-storm",
  "name": "Fire Storm",
  "desc": [
   "A storm made up of sheets of roaring flame appears in a location you choose within range. The area of the storm consists of up to ten 10-foot cubes, which you can arrange as you wish. Each cube must have at least one face adjacent to the face of another cube. Each creature in the area must make a dexterity saving throw. It takes 7d10 fire damage on a failed save, or half as much damage on a successful one.",
   "The fire damages objects in the area and ignites flammable objects that aren't being worn or carried. If you choose, plant life in the area is unaffected by this spell."
  ],
  "range": "150 feet",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 action",
  "level": 7,
  "damage": {
   "damage_type": {
    "index": "fire",
    "name": "Fire",
    "url": "/api/damage-types/fire"
   },
   "damage_at_slot_level": {
    "7": "7d10"
   }
  },
  "dc": {
   "dc_type": {
    "index": "dex",
    "name": "DEX",
    "url": "/api/ability-scores/dex"
   },
   "dc_success": "half"
  },
  "area_of_effect": {
   "type": "cube",
   "size": 100
  },
  "school": {
   "index": "evocation",
   "name": "Evocation",
   "url": "/api/magic-schools/evocation"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "sorcerer",
    "name": "Sorcerer",
    "url": "/api/classes/sorcerer"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/fire-storm"
 },
 {
  "index": "flame-strike",
  "name": "Flame Strike",
  "desc": [
   "A vertical column of divine fire roars down from the heavens in a location you specify. Each creature in a 10-foot-radius, 40-foot-high cylinder centered on a point within range must make a dexterity saving throw. A creature takes 4d6 fire damage and 4d6 radiant damage on a failed save, or half as much damage on a successful one."
  ],
  "higher_level": [
   "When you cast this spell using a spell slot of 6th level or higher, the fire damage or the radiant damage (your choice) increases by 1d6 for each slot level above 5th."
  ],
  "range": "60 feet",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "Pinch of sulfur.",
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 action",
  "level": 5,
  "damage": {
   "damage_type": {
    "index": "fire",
    "name": "Fire",
    "url": "/api/damage-types/fire"
   },
   "damage_at_slot_level": {
    "5": "4d6 + 4d6",
    "6": "4d6 + 5d6",
    "7": "4d6 + 6d6",
    "8": "4d6 + 7d6",
    "9": "4d6 + 8d6"
   }
  },
  "dc": {
   "dc_type": {
    "index": "dex",
    "name": "DEX",
    "url": "/api/ability-scores/dex"
   },
   "dc_success": "half"
  },
  "area_of_effect": {
   "type": "cylinder",
   "size": 40
  },
  "school": {
   "index": "evocation",
   "name": "Evocation",
   "url": "/api/magic-schools/evocation"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [
   {
    "index": "devotion",
    "name": "Devotion",
    "url": "/api/subclasses/devotion"
   },
   {
    "index": "fiend",
    "name": "Fiend",
    "url": "/api/subclasses/fiend"
   }
  ],
  "url": "/api/spells/flame-strike"
 },
 {
  "index": "forbiddance",
  "name": "Forbiddance",
  "desc": [
   "You create a ward against magical travel that protects up to 40,000 square feet of floor space to a height of 30 feet above the floor. For the duration, creatures can't teleport into the area or use portals, such as those created by the gate spell, to enter the area. The spell proofs the area against planar travel, and therefore prevents creatures from accessing the area by way of the Astral Plane, Ethereal Plane, Feywild, Shadowfell, or the plane shift spell.",
   "In addition, the spell damages types of creatures that you choose when you cast it. Choose one or more of the following: celestials, elementals, fey, fiends, and undead. When a chosen creature enters the spell's area for the first time on a turn or starts its turn there, the creature takes 5d10 radiant or necrotic damage (your choice when you cast this spell).",
   "When you cast this spell, you can designate a password. A creature that speaks the password as it enters the area takes no damage from the spell.",
   "The spell's area can't overlap with the area of another forbiddance spell. If you cast forbiddance every day for 30 days in the same location, the spell lasts until it is dispelled, and the material components are consumed on the last casting."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A sprinkling of holy water, rare incense, and powdered ruby worth at least 1,000 gp.",
  "ritual": true,
  "duration": "24 hours",
  "concentration": false,
  "casting_time": "10 minutes",
  "level": 6,
  "area_of_effect": {
   "type": "cube",
   "size": 40000
  },
  "school": {
   "index": "abjuration",
   "name": "Abjuration",
   "url": "/api/magic-schools/abjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/forbiddance"
 },
 {
  "index": "freedom-of-movement",
  "name": "Freedom of Movement",
  "desc": [
   "You touch a willing creature. For the duration, the target's movement is unaffected by difficult terrain, and spells and other magical effects can neither reduce the target's speed nor cause the target to be paralyzed or restrained.",
   "The target can also spend 5 feet of movement to automatically escape from nonmagical restraints, such as manacles or a creature that has it grappled. Finally, being underwater imposes no penalties on the target's movement or attacks."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A leather strap, bound around the arm or a similar appendage.",
  "ritual": false,
  "duration": "1 hour",
  "concentration": false,
  "casting_time": "1 action",
  "level": 4,
  "school": {
   "index": "abjuration",
   "name": "Abjuration",
   "url": "/api/magic-schools/abjuration"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "ranger",
    "name": "Ranger",
    "url": "/api/classes/ranger"
   }
  ],
  "subclasses": [
   {
    "index": "land",
    "name": "Land",
    "url": "/api/subclasses/land"
   },
   {
    "index": "devotion",
    "name": "Devotion",
    "url": "/api/subclasses/devotion"
   }
  ],
  "url": "/api/spells/freedom-of-movement"
 },
 {
  "index": "gate",
  "name": "Gate",
  "desc": [
   "You conjure a portal linking an unoccupied space you can see within range to a precise location on a different plane of existence. The portal is a circular opening, which you can make 5 to 20 feet in diameter. You can orient the portal in any direction you choose. The portal lasts for the duration.",
   "The portal has a front and a back on each plane where it appears. Travel through the portal is possible only by moving through its front. Anything that does so is instantly transported to the other plane, appearing in the unoccupied space nearest to the portal.",
   "Deities and other planar rulers can prevent portals created by this spell from opening in their presence or anywhere within their domains.",
   "When you cast this spell, you can speak the name of a specific creature (a pseudonym, title, or nickname doesn't work). If that creature is on a plane other than the one you are on, the portal opens in the named creature's immediate vicinity and draws the creature through it to the nearest unoccupied space on your side of the portal. You gain no special power over the creature, and it is free to act as the DM deems appropriate. It might leave, attack you, or help you."
  ],
  "range": "60 feet",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A diamond worth at least 5,000gp.",
  "ritual": false,
  "duration": "Up to 1 minute",
  "concentration": true,
  "casting_time": "1 action",
  "level": 9,
  "school": {
   "index": "conjuration",
   "name": "Conjuration",
   "url": "/api/magic-schools/conjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "sorcerer",
    "name": "Sorcerer",
    "url": "/api/classes/sorcerer"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/gate"
 },
 {
  "index": "geas",
  "name": "Geas",
  "desc": [
   "You place a magical command on a creature that you can see within range, forcing it to carry out some service or refrain from some action or course of activity as you decide. If the creature can understand you, it must succeed on a wisdom saving throw or become charmed by you for the duration. While the creature is charmed by you, it takes 5d10 psychic damage each time it acts in a manner directly counter to your instructions, but no more than once each day. A creature that can't understand you is unaffected by the spell.",
   "You can issue any command you choose, short of an activity that would result in certain death. Should you issue a suicidal command, the spell ends.",
   "You can end the spell early by using an action to dismiss it. A remove curse, greater restoration, or wish spell also ends it."
  ],
  "higher_level": [
   "When you cast this spell using a spell slot of 7th or 8th level, the duration is 1 year. When you cast this spell using a spell slot of 9th level, the spell lasts until it is ended by one of the spells mentioned above."
  ],
  "range": "60 feet",
  "components": [
   "V"
  ],
  "ritual": false,
  "duration": "30 days",
  "concentration": false,
  "casting_time": "1 minute",
  "level": 5,
  "dc": {
   "dc_type": {
    "index": "wis",
    "name": "WIS",
    "url": "/api/ability-scores/wis"
   },
   "dc_success": "none"
  },
  "school": {
   "index": "enchantment",
   "name": "Enchantment",
   "url": "/api/magic-schools/enchantment"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "paladin",
    "name": "Paladin",
    "url": "/api/classes/paladin"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/geas"
 },
 {
  "index": "gentle-repose",
  "name": "Gentle Repose",
  "desc": [
   "You touch a corpse or other remains. For the duration, the target is protected from decay and can't become undead.",
   "The spell also effectively extends the time limit on raising the target from the dead, since days spent under the influence of this spell don't count against the time limit of spells such as raise dead."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A pinch of salt and one copper piece placed on each of the corpse's eyes, which must remain there for the duration.",
  "ritual": true,
  "duration": "10 days",
  "concentration": false,
  "casting_time": "1 action",
  "level": 2,
  "school": {
   "index": "necromancy",
   "name": "Necromancy",
   "url": "/api/magic-schools/necromancy"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/gentle-repose"
 },
 {
  "index": "glyph-of-warding",
  "name": "Glyph of Warding",
  "desc": [
   "When you cast this spell, you enter a glyph that hurt other creatures, either on a surface (like a table or a portion of a floor or wall) or inside an object that can be closed (like a book a parchment or cabinet) to hide the glyph. If you opt for a surface, the glyph can cover an area of 10 feet or less in diameter. If you select an object, it must remain in place. If the object is moved to over 10 feet from where the spell was spell casts, the glyph breeze and the spell expires without being triggered.",
   "The glyph is virtually invisible and roll Intelligence (Investigation) against the fate of your save DC is required to find out.",
   "You determine the shutter glyph while casting the spell. For the glyphs inscribed on a surface, the triggers are typically hit or stand on a glyph remove an object placed on the glyph, approach at a certain distance of the glyph or manipulate an object on which is inscribed the glyph. For the glyphs inscribed in an object, triggers are typically open the object, approaching at a distance from the object, seen or read the glyph. Once the glyph is triggered, the spell ends.",
   "You can refine the trigger conditions so that the spell will work only in certain circumstances or in physical attributes (height or weight), the creature type (eg, only aberrations or the Dark Elves trigger the glyph) or alignment. You can also determine the conditions for certain creatures do not trigger the glyph, using a password, for example.",
   "When you sign the glyph, make a choice between the explosive runes or glyph fate.",
   "Explosive runes.",
   "When triggered, magical energy springs from the glyph in a 20-foot-radius sphere centered on the glyph. The sphere bypasses the corners. Each creature in the area must make a dexterity saving throw or it suffers 5d8 acid damage, lightning, fire, cold or thunder (to be determined during the creation of the glyph). If successful, the damage is halved.",
   "Sort glyph.",
   "You can store a level of 3 or less prepared spell in the glyph to chant during the creation of the glyph. The spell must target one creature or area. The stored spell has no immediate effect when spell casts that way. When the glyph is activated, the stored spell spell casts. If the spell is a target, it will target the creature that triggered the glyph. If the spell affects an area, the area is centered on that creature. If the spell invokes hostile creatures or creates sharp objects or traps, they also appear close as possible to the intruder and attack. If the spell requires concentration, it persists for the duration of the spell."
  ],
  "higher_level": [
   "When you cast this spell using a 4 or higher is level, the damage explosive runes increased by 1d8 for each level of top slot 3. If you create a glyph spell, you may store a spell whose level is equivalent or less to spell slot used for the custody of the glyph."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "Incense and powdered diamond worth at least 200 gp, the spell consumes.",
  "ritual": false,
  "duration": "Until dispelled",
  "concentration": false,
  "casting_time": "1 hour",
  "level": 3,
  "school": {
   "index": "abjuration",
   "name": "Abjuration",
   "url": "/api/magic-schools/abjuration"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/glyph-of-warding"
 },
 {
  "index": "greater-restoration",
  "name": "Greater Restoration",
  "desc": [
   "You imbue a creature you touch with positive energy to undo a debilitating effect. You can reduce the target's exhaustion level by one, or end one of the following effects on the target:",
   "- One effect that charmed or petrified the target",
   "- One curse, including the target's attunement to a cursed magic item",
   "- Any reduction to one of the target's ability scores",
   "- One effect reducing the target's hit point maximum"
  ],
  "range": "Touch",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "Diamond dust worth at least 100gp, which the spell consumes.",
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 action",
  "level": 5,
  "school": {
   "index": "abjuration",
   "name": "Abjuration",
   "url": "/api/magic-schools/abjuration"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/greater-restoration"
 },
 {
  "index": "guardian-of-faith",
  "name": "Guardian of Faith",
  "desc": [
   "A Large spectral guardian appears and hovers for the duration in an unoccupied space of your choice that you can see within range. The guardian occupies that space and is indistinct except for a gleaming sword and shield emblazoned with the symbol of your deity.",
   "Any creature hostile to you that moves to a space within 10 feet of the guardian for the first time on a turn must succeed on a dexterity saving throw. The creature takes 20 radiant damage on a failed save, or half as much damage on a successful one. The guardian vanishes when it has dealt a total of 60 damage."
  ],
  "range": "30 feet",
  "components": [
   "V"
  ],
  "ritual": false,
  "duration": "8 hours",
  "concentration": false,
  "casting_time": "1 action",
  "level": 4,
  "damage": {
   "damage_type": {
    "index": "radiant",
    "name": "Radiant",
    "url": "/api/damage-types/radiant"
   },
   "damage_at_slot_level": {
    "4": "20"
   }
  },
  "dc": {
   "dc_type": {
    "index": "dex",
    "name": "DEX",
    "url": "/api/ability-scores/dex"
   },
   "dc_success": "half"
  },
  "area_of_effect": {
   "type": "cylinder",
   "size": 10
  },
  "school": {
   "index": "conjuration",
   "name": "Conjuration",
   "url": "/api/magic-schools/conjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "paladin",
    "name": "Paladin",
    "url": "/api/classes/paladin"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/guardian-of-faith"
 },
 {
  "index": "guidance",
  "name": "Guidance",
  "desc": [
   "You touch one willing creature. Once before the spell ends, the target can roll a d4 and add the number rolled to one ability check of its choice. It can roll the die before or after making the ability check. The spell then ends."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "Up to 1 minute",
  "concentration": true,
  "casting_time": "1 action",
  "level": 0,
  "school": {
   "index": "divination",
   "name": "Divination",
   "url": "/api/magic-schools/divination"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/guidance"
 },
 {
  "index": "guiding-bolt",
  "name": "Guiding Bolt",
  "desc": [
   "A flash of light streaks toward a creature of your choice within range. Make a ranged spell attack against the target. On a hit, the target takes 4d6 radiant damage, and the next attack roll made against this target before the end of your next turn has advantage, thanks to the mystical dim light glittering on the target until then."
  ],
  "higher_level": [
   "When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st."
  ],
  "range": "120 feet",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "1 round",
  "concentration": false,
  "casting_time": "1 action",
  "level": 1,
  "attack_type": "ranged",
  "damage": {
   "damage_type": {
    "index": "radiant",
    "name": "Radiant",
    "url": "/api/damage-types/radiant"
   },
   "damage_at_slot_level": {
    "1": "4d6",
    "2": "5d6",
    "3": "6d6",
    "4": "7d6",
    "5": "8d6",
    "6": "9d6",
    "7": "10d6",
    "8": "11d6",
    "9": "12d6"
   }
  },
  "school": {
   "index": "evocation",
   "name": "Evocation",
   "url": "/api/magic-schools/evocation"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/guiding-bolt"
 },
 {
  "index": "hallow",
  "name": "Hallow",
  "desc": [
   "You touch a point and infuse an area around it with holy (or unholy) power. The area can have a radius up to 60 feet, and the spell fails if the radius includes an area already under the effect a hallow spell. The affected area is subject to the following effects.",
   "First, celestials, elementals, fey, fiends, and undead can't enter the area, nor can such creatures charm, frighten, or possess creatures within it. Any creature charmed, frightened, or possessed by such a creature is no longer charmed, frightened, or possessed upon entering the area. You can exclude one or more of those types of creatures from this effect.",
   "Second, you can bind an extra effect to the area. Choose the effect from the following list, or choose an effect offered by the DM. Some of these effects apply to creatures in the area; you can designate whether the effect applies to all creatures, creatures that follow a specific deity or leader, or creatures of a specific sort, such as ores or trolls. When a creature that would be affected enters the spell's area for the first time on a turn or starts its turn there, it can make a charisma saving throw. On a success, the creature ignores the extra effect until it leaves the area.",
   "Courage.",
   "Affected creatures can't be frightened while in the area.",
   "Darkness.",
   "Darkness fills the area. Normal light, as well as magical light created by spells of a lower level than the slot you used to cast this spell, can't illuminate the area.",
   "Daylight.",
   "Bright light fills the area. Magical darkness created by spells of a lower level than the slot you used to cast this spell can't extinguish the light.",
   "Energy Protection.",
   "Affected creatures in the area have resistance to one damage type of your choice, except for bludgeoning, piercing, or slashing.",
   "Energy Vulnerability.",
   "Affected creatures in the area have vulnerability to one damage type of your choice, except for bludgeoning, piercing, or slashing.",
   "Everlasting Rest.",
   "Dead bodies interred in the area can't be turned into undead.",
   "Extradimensional Interference.",
   "Affected creatures can't move or travel using teleportation or by extradimensional or interplanar means.",
   "Fear.",
   "Affected creatures are frightened while in the area.",
   "Silence.",
   "No sound can emanate from within the area, and no sound can reach into it.",
   "Tongues.",
   "Affected creatures can communicate with any other creature in the area, even if they don't share a common language."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "Herbs, oils, and incense worth at least 1,000 gp, which the spell consumes.",
  "ritual": false,
  "duration": "Until dispelled",
  "concentration": false,
  "casting_time": "24 hours",
  "level": 5,
  "dc": {
   "dc_type": {
    "index": "cha",
    "name": "CHA",
    "url": "/api/ability-scores/cha"
   },
   "dc_success": "none"
  },
  "area_of_effect": {
   "type": "sphere",
   "size": 60
  },
  "school": {
   "index": "evocation",
   "name": "Evocation",
   "url": "/api/magic-schools/evocation"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [
   {
    "index": "fiend",
    "name": "Fiend",
    "url": "/api/subclasses/fiend"
   }
  ],
  "url": "/api/spells/hallow"
 },
 {
  "index": "harm",
  "name": "Harm",
  "desc": [
   "You unleash a virulent disease on a creature that you can see within range. The target must make a constitution saving throw. On a failed save, it takes 14d6 necrotic damage, or half as much damage on a successful save. The damage can't reduce the target's hit points below 1. If the target fails the saving throw, its hit point maximum is reduced for 1 hour by an amount equal to the necrotic damage it took. Any effect that removes a disease allows a creature's hit point maximum to return to normal before that time passes."
  ],
  "range": "60 feet",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 action",
  "level": 6,
  "damage": {
   "damage_type": {
    "index": "necrotic",
    "name": "Necrotic",
    "url": "/api/damage-types/necrotic"
   },
   "damage_at_slot_level": {
    "6": "14d6"
   }
  },
  "dc": {
   "dc_type": {
    "index": "con",
    "name": "CON",
    "url": "/api/ability-scores/con"
   },
   "dc_success": "half"
  },
  "school": {
   "index": "necromancy",
   "name": "Necromancy",
   "url": "/api/magic-schools/necromancy"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/harm"
 },
 {
  "index": "heal",
  "name": "Heal",
  "desc": [
   "Choose a creature that you can see within range. A surge of positive energy washes through the creature, causing it to regain 70 hit points. This spell also ends blindness, deafness, and any diseases affecting the target. This spell has no effect on constructs or undead."
  ],
  "higher_level": [
   "When you cast this spell using a spell slot of 7th level or higher, the amount of healing increases by 10 for each slot level above 6th."
  ],
  "range": "60 feet",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 action",
  "level": 6,
  "heal_at_slot_level": {
   "6": "70",
   "7": "80",
   "8": "90",
   "9": "100"
  },
  "school": {
   "index": "evocation",
   "name": "Evocation",
   "url": "/api/magic-schools/evocation"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/heal"
 },
 {
  "index": "healing-word",
  "name": "Healing Word",
  "desc": [
   "A creature of your choice that you can see within range regains hit points equal to 1d4 + your spellcasting ability modifier. This spell has no effect on undead or constructs."
  ],
  "higher_level": [
   "When you cast this spell using a spell slot of 2nd level or higher, the healing increases by 1d4 for each slot level above 1st."
  ],
  "range": "60 feet",
  "components": [
   "V"
  ],
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 bonus action",
  "level": 1,
  "heal_at_slot_level": {
   "1": "1d4 + MOD",
   "2": "2d4 + MOD",
   "3": "3d4 + MOD",
   "4": "4d4 + MOD",
   "5": "5d4 + MOD",
   "6": "6d4 + MOD",
   "7": "7d4 + MOD",
   "8": "8d4 + MOD",
   "9": "9d4 + MOD"
  },
  "school": {
   "index": "evocation",
   "name": "Evocation",
   "url": "/api/magic-schools/evocation"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/healing-word"
 },
 {
  "index": "heroes-feast",
  "name": "Heroes' Feast",
  "desc": [
   "You bring forth a great feast, including magnificent food and drink. The feast takes 1 hour to consume and disappears at the end of that time, and the beneficial effects don't set in until this hour is over. Up to twelve other creatures can partake of the feast.",
   "A creature that partakes of the feast gains several benefits. The creature is cured of all diseases and poison, becomes immune to poison and being frightened, and makes all wisdom saving throws with advantage. Its hit point maximum also increases by 2d10, and it gains the same number of hit points. These benefits last for 24 hours."
  ],
  "range": "30 feet",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A gem-encrusted bowl worth at least 1,000gp, which the spell consumes.",
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "10 minutes",
  "level": 6,
  "school": {
   "index": "conjuration",
   "name": "Conjuration",
   "url": "/api/magic-schools/conjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/heroes-feast"
 },
 {
  "index": "hold-person",
  "name": "Hold Person",
  "desc": [
   "Choose a humanoid that you can see within range. The target must succeed on a wisdom saving throw or be paralyzed for the duration. At the end of each of its turns, the target can make another wisdom saving throw. On a success, the spell ends on the target."
  ],
  "higher_level": [
   "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional humanoid for each slot level above 2nd. The humanoids must be within 30 feet of each other when you target them."
  ],
  "range": "60 feet",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A small, straight piece of iron.",
  "ritual": false,
  "duration": "Up to 1 minute",
  "concentration": true,
  "casting_time": "1 action",
  "level": 2,
  "dc": {
   "dc_type": {
    "index": "wis",
    "name": "WIS",
    "url": "/api/ability-scores/wis"
   },
   "dc_success": "none"
  },
  "school": {
   "index": "enchantment",
   "name": "Enchantment",
   "url": "/api/magic-schools/enchantment"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "sorcerer",
    "name": "Sorcerer",
    "url": "/api/classes/sorcerer"
   },
   {
    "index": "warlock",
    "name": "Warlock",
    "url": "/api/classes/warlock"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   },
   {
    "index": "land",
    "name": "Land",
    "url": "/api/subclasses/land"
   }
  ],
  "url": "/api/spells/hold-person"
 },
 {
  "index": "holy-aura",
  "name": "Holy Aura",
  "desc": [
   "Divine light washes out from you and coalesces in a soft radiance in a 30-foot radius around you. Creatures of your choice in that radius when you cast this spell shed dim light in a 5-foot radius and have advantage on all saving throws, and other creatures have disadvantage on attack rolls against them until the spell ends. In addition, when a fiend or an undead hits an affected creature with a melee attack, the aura flashes with brilliant light. The attacker must succeed on a constitution saving throw or be blinded until the spell ends."
  ],
  "range": "Self",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A tiny reliquary worth at least 1,000gp containing a sacred relic, such as a scrap of cloth from a saint's robe or a piece of parchment from a religious text.",
  "ritual": false,
  "duration": "Up to 1 minute",
  "concentration": true,
  "casting_time": "1 action",
  "level": 8,
  "area_of_effect": {
   "type": "sphere",
   "size": 30
  },
  "school": {
   "index": "abjuration",
   "name": "Abjuration",
   "url": "/api/magic-schools/abjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/holy-aura"
 },
 {
  "index": "inflict-wounds",
  "name": "Inflict Wounds",
  "desc": [
   "Make a melee spell attack against a creature you can reach. On a hit, the target takes 3d10 necrotic damage."
  ],
  "higher_level": [
   "When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d10 for each slot level above 1st."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 action",
  "level": 1,
  "attack_type": "melee",
  "damage": {
   "damage_type": {
    "index": "necrotic",
    "name": "Necrotic",
    "url": "/api/damage-types/necrotic"
   },
   "damage_at_slot_level": {
    "1": "3d10",
    "2": "4d10",
    "3": "5d10",
    "4": "6d10",
    "5": "7d10",
    "6": "8d10",
    "7": "9d10",
    "8": "10d10",
    "9": "11d10"
   }
  },
  "school": {
   "index": "necromancy",
   "name": "Necromancy",
   "url": "/api/magic-schools/necromancy"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/inflict-wounds"
 },
 {
  "index": "insect-plague",
  "name": "Insect Plague",
  "desc": [
   "Swarming, biting locusts fill a 20-foot-radius sphere centered on a point you choose within range. The sphere spreads around corners. The sphere remains for the duration, and its area is lightly obscured. The sphere's area is difficult terrain.",
   "When the area appears, each creature in it must make a constitution saving throw. A creature takes 4d10 piercing damage on a failed save, or half as much damage on a successful one. A creature must also make this saving throw when it enters the spell's area for the first time on a turn or ends its turn there."
  ],
  "higher_level": [
   "When you cast this spell using a spell slot of 6th level or higher, the damage increases by 1d10 for each slot level above 5th."
  ],
  "range": "300 feet",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A few grains of sugar, some kernels of grain, and a smear of fat.",
  "ritual": false,
  "duration": "Up to 10 minutes",
  "concentration": true,
  "casting_time": "1 action",
  "level": 5,
  "damage": {
   "damage_type": {
    "index": "piercing",
    "name": "Piercing",
    "url": "/api/damage-types/piercing"
   },
   "damage_at_slot_level": {
    "5": "4d10",
    "6": "5d10",
    "7": "6d10",
    "8": "7d10",
    "9": "8d10"
   }
  },
  "dc": {
   "dc_type": {
    "index": "con",
    "name": "CON",
    "url": "/api/ability-scores/con"
   },
   "dc_success": "half"
  },
  "area_of_effect": {
   "type": "sphere",
   "size": 20
  },
  "school": {
   "index": "conjuration",
   "name": "Conjuration",
   "url": "/api/magic-schools/conjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "sorcerer",
    "name": "Sorcerer",
    "url": "/api/classes/sorcerer"
   }
  ],
  "subclasses": [
   {
    "index": "land",
    "name": "Land",
    "url": "/api/subclasses/land"
   }
  ],
  "url": "/api/spells/insect-plague"
 },
 {
  "index": "legend-lore",
  "name": "Legend Lore",
  "desc": [
   "Name or describe a person, place, or object. The spell brings to your mind a brief summary of the significant lore about the thing you named. The lore might consist of current tales, forgotten stories, or even secret lore that has never been widely known. If the thing you named isn't of legendary importance, you gain no information. The more information you already have about the thing, the more precise and detailed the information you receive is.",
   "The information you learn is accurate but might be couched in figurative language. For example, if you have a mysterious magic axe on hand the spell might yield this information: \"Woe to the evildoer whose hand touches the axe, for even the haft slices the hand of the evil ones. Only a true Child of Stone, lover and beloved of Moradin, may awaken the true powers of the axe, and only with the sacred word Rudnogg on the lips.\""
  ],
  "range": "Self",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "Incense worth 250 inches that fate consumes and four sticks of ivory worth 50 gp each.",
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "10 minutes",
  "level": 5,
  "school": {
   "index": "divination",
   "name": "Divination",
   "url": "/api/magic-schools/divination"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/legend-lore"
 },
 {
  "index": "lesser-restoration",
  "name": "Lesser Restoration",
  "desc": [
   "You touch a creature and can end either one disease or one condition afflicting it. The condition can be blinded, deafened, paralyzed, or poisoned."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 action",
  "level": 2,
  "school": {
   "index": "abjuration",
   "name": "Abjuration",
   "url": "/api/magic-schools/abjuration"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "paladin",
    "name": "Paladin",
    "url": "/api/classes/paladin"
   },
   {
    "index": "ranger",
    "name": "Ranger",
    "url": "/api/classes/ranger"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   },
   {
    "index": "life",
    "name": "Life",
    "url": "/api/subclasses/life"
   },
   {
    "index": "devotion",
    "name": "Devotion",
    "url": "/api/subclasses/devotion"
   }
  ],
  "url": "/api/spells/lesser-restoration"
 },
 {
  "index": "light",
  "name": "Light",
  "desc": [
   "You touch one object that is no larger than 10 feet in any dimension. Until the spell ends, the object sheds bright light in a 20-foot radius and dim light for an additional 20 feet. The light can be colored as you like. Completely covering the object with something opaque blocks the light. The spell ends if you cast it again or dismiss it as an action.",
   "If you target an object held or worn by a hostile creature, that creature must succeed on a dexterity saving throw to avoid the spell."
  ],
  "range": "Touch",
  "components": [
   "V",
   "M"
  ],
  "material": "A firefly or phosphorescent moss.",
  "ritual": false,
  "duration": "1 hour",
  "concentration": false,
  "casting_time": "1 action",
  "level": 0,
  "dc": {
   "dc_type": {
    "index": "dex",
    "name": "DEX",
    "url": "/api/ability-scores/dex"
   },
   "dc_success": "none"
  },
  "school": {
   "index": "evocation",
   "name": "Evocation",
   "url": "/api/magic-schools/evocation"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "sorcerer",
    "name": "Sorcerer",
    "url": "/api/classes/sorcerer"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/light"
 },
 {
  "index": "locate-creature",
  "name": "Locate Creature",
  "desc": [
   "Describe or name a creature that is familiar to you. You sense the direction to the creature's location, as long as that creature is within 1,000 feet of you. If the creature is moving, you know the direction of its movement.",
   "The spell can locate a specific creature known to you, or the nearest creature of a specific kind (such as a human or a unicorn), so long as you have seen such a creature up close--within 30 feet--at least once. If the creature you described or named is in a different form, such as being under the effects of a polymorph spell, this spell doesn't locate the creature.",
   "This spell can't locate a creature if running water at least 10 feet wide blocks a direct path between you and the creature."
  ],
  "range": "Self",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A bit of fur from a bloodhound.",
  "ritual": false,
  "duration": "Up to 1 hour",
  "concentration": true,
  "casting_time": "1 action",
  "level": 4,
  "school": {
   "index": "divination",
   "name": "Divination",
   "url": "/api/magic-schools/divination"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "paladin",
    "name": "Paladin",
    "url": "/api/classes/paladin"
   },
   {
    "index": "ranger",
    "name": "Ranger",
    "url": "/api/classes/ranger"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [
   {
    "index": "land",
    "name": "Land",
    "url": "/api/subclasses/land"
   }
  ],
  "url": "/api/spells/locate-creature"
 },
 {
  "index": "locate-object",
  "name": "Locate Object",
  "desc": [
   "Describe or name an object that is familiar to you. You sense the direction to the object's location, as long as that object is within 1,000 feet of you. If the object is in motion, you know the direction of its movement.",
   "The spell can locate a specific object known to you, as long as you have seen it up close--within 30 feet--at least once. Alternatively, the spell can locate the nearest object of a particular kind, such as a certain kind of apparel, jewelry, furniture, tool, or weapon.",
   "This spell can't locate an object if any thickness of lead, even a thin sheet, blocks a direct path between you and the object."
  ],
  "range": "Self",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A forked twig.",
  "ritual": false,
  "duration": "Up to 10 minutes",
  "concentration": true,
  "casting_time": "1 action",
  "level": 2,
  "school": {
   "index": "divination",
   "name": "Divination",
   "url": "/api/magic-schools/divination"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "paladin",
    "name": "Paladin",
    "url": "/api/classes/paladin"
   },
   {
    "index": "ranger",
    "name": "Ranger",
    "url": "/api/classes/ranger"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/locate-object"
 },
 {
  "index": "magic-circle",
  "name": "Magic Circle",
  "desc": [
   "You create a 10-foot radius, 20-foot-tall cylinder of magical energy centered on a point on the ground that you can see within range. Glowing runes appear whetever the cylinder intersects with the floor or other surface.",
   "Choose one or more of the following types of creatures: celestials, elementals, fey, fiends, or undead. The circle affects a creature of the chosen type in the following ways:",
   "- The creature can't willingly enter the cylinder by nonmagical means. If the creature tries to use teleportation or interplanar travel to do so, it must first succeed on a charisma saving throw.",
   "- The creature has disadvantage on attack rolls against targets within the cylinder.",
   "- Targets within the cylinder can't be charmed, frightened, or possessed by the creature.",
   "When you cast this spell, you can elect to cause its magic to operate in the reverse direction, preventing a creature of the specified type from leaving the cylinder and protecting targets outside it."
  ],
  "higher_level": [
   "When you cast this spell using a spell slot of 4th level or higher, the duration increases by 1 hour for each slot level above 3rd."
  ],
  "range": "10 feet",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "Holy water or powdered silver and iron worth at least 100 gp, which the spell consumes.",
  "ritual": false,
  "duration": "1 hour",
  "concentration": false,
  "casting_time": "1 minute",
  "level": 3,
  "area_of_effect": {
   "type": "cylinder",
   "size": 10
  },
  "dc": {
   "dc_type": {
    "index": "cha",
    "name": "CHA",
    "url": "/api/ability-scores/cha"
   },
   "dc_success": "other",
   "desc": "If the creature tries to use teleportation or interplanar travel to do so, it must first succeed on a Charisma saving throw."
  },
  "school": {
   "index": "abjuration",
   "name": "Abjuration",
   "url": "/api/magic-schools/abjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "paladin",
    "name": "Paladin",
    "url": "/api/classes/paladin"
   },
   {
    "index": "warlock",
    "name": "Warlock",
    "url": "/api/classes/warlock"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/magic-circle"
 },
 {
  "index": "mass-cure-wounds",
  "name": "Mass Cure Wounds",
  "desc": [
   "A wave of healing energy washes out from a point of your choice within range. Choose up to six creatures in a 30-foot-radius sphere centered on that point. Each target regains hit points equal to 3d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs."
  ],
  "higher_level": [
   "When you cast this spell using a spell slot of 6th level or higher, the healing increases by 1d8 for each slot level above 5th."
  ],
  "range": "60 feet",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 action",
  "level": 5,
  "attack_type": "ranged",
  "heal_at_slot_level": {
   "5": "3d8 + MOD",
   "6": "4d8 + MOD",
   "7": "5d8 + MOD",
   "8": "6d8 + MOD",
   "9": "7d8 + MOD"
  },
  "area_of_effect": {
   "type": "sphere",
   "size": 30
  },
  "school": {
   "index": "conjuration",
   "name": "Conjuration",
   "url": "/api/magic-schools/conjuration"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   }
  ],
  "subclasses": [
   {
    "index": "life",
    "name": "Life",
    "url": "/api/subclasses/life"
   }
  ],
  "url": "/api/spells/mass-cure-wounds"
 },
 {
  "index": "mass-heal",
  "name": "Mass Heal",
  "desc": [
   "A flood of healing energy flows from you into injured creatures around you. You restore up to 700 hit points, divided as you choose among any number of creatures that you can see within range. Creatures healed by this spell are also cured of all diseases and any effect making them blinded or deafened. This spell has no effect on undead or constructs."
  ],
  "range": "60 feet",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 action",
  "level": 9,
  "heal_at_slot_level": {
   "9": "700"
  },
  "school": {
   "index": "conjuration",
   "name": "Conjuration",
   "url": "/api/magic-schools/conjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/mass-heal"
 },
 {
  "index": "mass-healing-word",
  "name": "Mass Healing Word",
  "desc": [
   "As you call out words of restoration, up to six creatures of your choice that you can see within range regain hit points equal to 1d4 + your spellcasting ability modifier. This spell has no effect on undead or constructs."
  ],
  "higher_level": [
   "When you cast this spell using a spell slot of 4th level or higher, the healing increases by 1d4 for each slot level above 3rd."
  ],
  "range": "60 feet",
  "components": [
   "V"
  ],
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 bonus action",
  "level": 3,
  "heal_at_slot_level": {
   "3": "1d4 + MOD",
   "4": "2d4 + MOD",
   "5": "3d4 + MOD",
   "6": "4d4 + MOD",
   "7": "5d4 + MOD",
   "8": "6d4 + MOD",
   "9": "7d4 + MOD"
  },
  "school": {
   "index": "evocation",
   "name": "Evocation",
   "url": "/api/magic-schools/evocation"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/mass-healing-word"
 },
 {
  "index": "meld-into-stone",
  "name": "Meld Into Stone",
  "desc": [
   "You step into a stone object or surface large enough to fully contain your body, melding yourself and all the equipment you carry with the stone for the duration. Using your movement, you step into the stone at a point you can touch. Nothing of your presence remains visible or otherwise detectable by nonmagical senses.",
   "While merged with the stone, you can't see what occurs outside it, and any Wisdom (Perception) checks you make to hear sounds outside it are made with disadvantage. You remain aware of the passage of time and can cast spells on yourself while merged in the stone. You can use your movement to leave the stone where you entered it, which ends the spell. You otherwise can't move.",
   "Minor physical damage to the stone doesn't harm you, but its partial destruction or a change in its shape (to the extent that you no longer fit within it) expels you and deals 6d6 bludgeoning damage to you. The stone's complete destruction (or transmutation into a different substance) expels you and deals 50 bludgeoning damage to you. If expelled, you fall prone in an unoccupied space closest to where you first entered."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S"
  ],
  "ritual": true,
  "duration": "8 hours",
  "concentration": false,
  "casting_time": "1 action",
  "level": 3,
  "school": {
   "index": "transmutation",
   "name": "Transmutation",
   "url": "/api/magic-schools/transmutation"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   },
   {
    "index": "land",
    "name": "Land",
    "url": "/api/subclasses/land"
   }
  ],
  "url": "/api/spells/meld-into-stone"
 },
 {
  "index": "mending",
  "name": "Mending",
  "desc": [
   "This spell repairs a single break or tear in an object you touch, such as a broken key, a torn cloak, or a leaking wineskin. As long as the break or tear is no longer than 1 foot in any dimension, you mend it, leaving no trace of the former damage.",
   "This spell can physically repair a magic item or construct, but the spell can't restore magic to such an object."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "Two lodestones.",
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 minute",
  "level": 0,
  "school": {
   "index": "transmutation",
   "name": "Transmutation",
   "url": "/api/magic-schools/transmutation"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "sorcerer",
    "name": "Sorcerer",
    "url": "/api/classes/sorcerer"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/mending"
 },
 {
  "index": "planar-ally",
  "name": "Planar Ally",
  "desc": [
   "You beseech an otherworldly entity for aid. The being must be known to you: a god, a primordial, a demon prince, or some other being of cosmic power. That entity sends a celestial, an elemental, or a fiend loyal to it to aid you, making the creature appear in an unoccupied space within range. If you know a specific creature's name, you can speak that name when you cast this spell to request that creature, though you might get a different creature anyway (DM's choice).",
   "When the creature appears, it is under no compulsion to behave in any particular way. You can ask the creature to perform a service in exchange for payment, but it isn't obliged to do so. The requested task could range from simple (fly us across the chasm, or help us fight a battle) to complex (spy on our enemies, or protect us during our foray into the dungeon). You must be able to communicate with the creature to bargain for its services.",
   "Payment can take a variety of forms. A celestial might require a sizable donation of gold or magic items to an allied temple, while a fiend might demand a living sacrifice or a gift of treasure. Some creatures might exchange their service for a quest undertaken by you.",
   "As a rule of thumb, a task that can be measured in minutes requires a payment worth 100 gp per minute. A task measured in hours requires 1,000 gp per hour. And a task measured in days (up to 10 days) requires 10,000 gp per day. The DM can adjust these payments based on the circumstances under which you cast the spell. If the task is aligned with the creature's ethos, the payment might be halved or even waived. Nonhazardous tasks typically require only half the suggested payment, while especially dangerous tasks might require a greater gift. Creatures rarely accept tasks that seem suicidal.",
   "After the creature completes the task, or when the agreed-upon duration of service expires, the creature returns to its home plane after reporting back to you, if appropriate to the task and if possible. If you are unable to agree on a price for the creature's service, the creature immediately returns to its home plane.",
   "A creature enlisted to join your group counts as a member of it, receiving a full share of experience points awarded."
  ],
  "range": "60 feet",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "10 minutes",
  "level": 6,
  "school": {
   "index": "conjuration",
   "name": "Conjuration",
   "url": "/api/magic-schools/conjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/planar-ally"
 },
 {
  "index": "planar-binding",
  "name": "Planar Binding",
  "desc": [
   "With this spell, you attempt to bind a celestial, an elemental, a fey, or a fiend to your service. The creature must be within range for the entire casting of the spell. (Typically, the creature is first summoned into the center of an inverted magic circle in order to keep it trapped while this spell is cast.) At the completion of the casting, the target must make a charisma saving throw. On a failed save, it is bound to serve you for the duration. If the creature was summoned or created by another spell, that spell's duration is extended to match the duration of this spell.",
   "A bound creature must follow your instructions to the best of its ability. You might command the creature to accompany you on an adventure, to guard a location, or to deliver a message. The creature obeys the letter of your instructions, but if the creature is hostile to you, it strives to twist your words to achieve its own objectives. If the creature carries out your instructions completely before the spell ends, it travels to you to report this fact if you are on the same plane of existence. If you are on a different plane of existence, it returns to the place where you bound it and remains there until the spell ends."
  ],
  "higher_level": [
   "When you cast this spell using a spell slot of a higher level, the duration increases to 10 days with a 6th-level slot, to 30 days with a 7th-level slot, to 180 days with an 8th-level slot, and to a year and a day with a 9th-level spell slot."
  ],
  "range": "60 feet",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A jewel worth at least 1,000 gp, which the spell consumes.",
  "ritual": false,
  "duration": "24 hours",
  "concentration": false,
  "casting_time": "1 hour",
  "level": 5,
  "dc": {
   "dc_type": {
    "index": "cha",
    "name": "CHA",
    "url": "/api/ability-scores/cha"
   },
   "dc_success": "none"
  },
  "school": {
   "index": "abjuration",
   "name": "Abjuration",
   "url": "/api/magic-schools/abjuration"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/planar-binding"
 },
 {
  "index": "plane-shift",
  "name": "Plane Shift",
  "desc": [
   "You and up to eight willing creatures who link hands in a circle are transported to a different plane of existence. You can specify a target destination in general terms, such as the City of Brass on the Elemental Plane of Fire or the palace of Dispater on the second level of the Nine Hells, and you appear in or near that destination. If you are trying to reach the City of Brass, for example, you might arrive in its Street of Steel, before its Gate of Ashes, or looking at the city from across the Sea of Fire, at the DM's discretion.",
   "Alternatively, if you know the sigil sequence of a teleportation circle on another plane of existence, this spell can take you to that circle. If the teleportation circle is too small to hold all the creatures you transported, they appear in the closest unoccupied spaces next to the circle.",
   "You can use this spell to banish an unwilling creature to another plane. Choose a creature within your reach and make a melee spell attack against it. On a hit, the creature must make a charisma saving throw. If the creature fails this save, it is transported to a random location on the plane of existence you specify. A creature so transported must find its own way back to your current plane of existence."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A forked, metal rod worth at least 250 gp, attuned to a particular plane of existence.",
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 action",
  "level": 7,
  "attack_type": "melee",
  "dc": {
   "dc_type": {
    "index": "cha",
    "name": "CHA",
    "url": "/api/ability-scores/cha"
   },
   "dc_success": "none",
   "desc": "If the creature fails this save, it is transported to a random location on the plane of existence you specify. A creature so transported must find its own way back to your current plane of existence."
  },
  "school": {
   "index": "conjuration",
   "name": "Conjuration",
   "url": "/api/magic-schools/conjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "sorcerer",
    "name": "Sorcerer",
    "url": "/api/classes/sorcerer"
   },
   {
    "index": "warlock",
    "name": "Warlock",
    "url": "/api/classes/warlock"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/plane-shift"
 },
 {
  "index": "prayer-of-healing",
  "name": "Prayer of Healing",
  "desc": [
   "Up to six creatures of your choice that you can see within range each regain hit points equal to 2d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs."
  ],
  "higher_level": [
   "When you cast this spell using a spell slot of 3rd level or higher, the healing increases by 1d8 for each slot level above 2nd."
  ],
  "range": "30 feet",
  "components": [
   "V"
  ],
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "10 minutes",
  "level": 2,
  "heal_at_slot_level": {
   "2": "2d8 + MOD",
   "3": "3d8 + MOD",
   "4": "4d8 + MOD",
   "5": "5d8 + MOD",
   "6": "6d8 + MOD",
   "7": "7d8 + MOD",
   "8": "8d8 + MOD",
   "9": "9d8 + MOD"
  },
  "school": {
   "index": "evocation",
   "name": "Evocation",
   "url": "/api/magic-schools/evocation"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/prayer-of-healing"
 },
 {
  "index": "protection-from-energy",
  "name": "Protection From Energy",
  "desc": [
   "For the duration, the willing creature you touch has resistance to one damage type of your choice: acid, cold, fire, lightning, or thunder."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "Up to 1 hour",
  "concentration": true,
  "casting_time": "1 action",
  "level": 3,
  "school": {
   "index": "abjuration",
   "name": "Abjuration",
   "url": "/api/magic-schools/abjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "ranger",
    "name": "Ranger",
    "url": "/api/classes/ranger"
   },
   {
    "index": "sorcerer",
    "name": "Sorcerer",
    "url": "/api/classes/sorcerer"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   },
   {
    "index": "land",
    "name": "Land",
    "url": "/api/subclasses/land"
   }
  ],
  "url": "/api/spells/protection-from-energy"
 },
 {
  "index": "protection-from-evil-and-good",
  "name": "Protection from Evil and Good",
  "desc": [
   "Until the spell ends, one willing creature you touch is protected against certain types of creatures: aberrations, celestials, elementals, fey, fiends, and undead.",
   "The protection grants several benefits. Creatures of those types have disadvantage on attack rolls against the target. The target also can't be charmed, frightened, or possessed by them. If the target is already charmed, frightened, or possessed by such a creature, the target has advantage on any new saving throw against the relevant effect."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "Holy water or powdered silver and iron, which the spell consumes.",
  "ritual": false,
  "duration": "Up to 10 minutes",
  "concentration": true,
  "casting_time": "1 action",
  "level": 1,
  "school": {
   "index": "abjuration",
   "name": "Abjuration",
   "url": "/api/magic-schools/abjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "paladin",
    "name": "Paladin",
    "url": "/api/classes/paladin"
   },
   {
    "index": "warlock",
    "name": "Warlock",
    "url": "/api/classes/warlock"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   },
   {
    "index": "devotion",
    "name": "Devotion",
    "url": "/api/subclasses/devotion"
   }
  ],
  "url": "/api/spells/protection-from-evil-and-good"
 },
 {
  "index": "protection-from-poison",
  "name": "Protection from Poison",
  "desc": [
   "You touch a creature. If it is poisoned, you neutralize the poison. If more than one poison afflicts the target, you neutralize one poison that you know is present, or you neutralize one at random.",
   "For the duration, the target has advantage on saving throws against being poisoned, and it has resistance to poison damage."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "1 hour",
  "concentration": false,
  "casting_time": "1 action",
  "level": 2,
  "school": {
   "index": "abjuration",
   "name": "Abjuration",
   "url": "/api/magic-schools/abjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "paladin",
    "name": "Paladin",
    "url": "/api/classes/paladin"
   },
   {
    "index": "ranger",
    "name": "Ranger",
    "url": "/api/classes/ranger"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/protection-from-poison"
 },
 {
  "index": "purify-food-and-drink",
  "name": "Purify Food and Drink",
  "desc": [
   "All nonmagical food and drink within a 5-foot radius sphere centered on a point of your choice within range is purified and rendered free of poison and disease."
  ],
  "range": "10 feet",
  "components": [
   "V",
   "S"
  ],
  "ritual": true,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 action",
  "level": 1,
  "school": {
   "index": "transmutation",
   "name": "Transmutation",
   "url": "/api/magic-schools/transmutation"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "paladin",
    "name": "Paladin",
    "url": "/api/classes/paladin"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/purify-food-and-drink"
 },
 {
  "index": "raise-dead",
  "name": "Raise Dead",
  "desc": [
   "You return a dead creature you touch to life, provided that it has been dead no longer than 10 days. If the creature's soul is both willing and at liberty to rejoin the body, the creature returns to life with 1 hit point.",
   "This spell also neutralizes any poisons and cures nonmagical diseases that affected the creature at the time it died. This spell doesn't, however, remove magical diseases, curses, or similar effects; if these aren't first removed prior to casting the spell, they take effect when the creature returns to life. The spell can't return an undead creature to life.",
   "This spell closes all mortal wounds, but it doesn't restore missing body parts. If the creature is lacking body parts or organs integral for its survival--its head, for instance--the spell automatically fails.",
   "Coming back from the dead is an ordeal. The target takes a -4 penalty to all attack rolls, saving throws, and ability checks. Every time the target finishes a long rest, the penalty is reduced by 1 until it disappears."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A diamond worth at least 500gp, which the spell consumes.",
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 hour",
  "level": 5,
  "school": {
   "index": "necromancy",
   "name": "Necromancy",
   "url": "/api/magic-schools/necromancy"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "paladin",
    "name": "Paladin",
    "url": "/api/classes/paladin"
   }
  ],
  "subclasses": [
   {
    "index": "life",
    "name": "Life",
    "url": "/api/subclasses/life"
   }
  ],
  "url": "/api/spells/raise-dead"
 },
 {
  "index": "regenerate",
  "name": "Regenerate",
  "desc": [
   "You touch a creature and stimulate its natural healing ability. The target regains 4d8 + 15 hit points. For the duration of the spell, the target regains 1 hit point at the start of each of its turns (10 hit points each minute).",
   "The target's severed body members (fingers, legs, tails, and so on), if any, are restored after 2 minutes. If you have the severed part and hold it to the stump, the spell instantaneously causes the limb to knit to the stump."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A prayer wheel and holy water.",
  "ritual": false,
  "duration": "1 hour",
  "concentration": false,
  "casting_time": "1 minute",
  "level": 7,
  "heal_at_slot_level": {
   "7": "4d8 + 15"
  },
  "school": {
   "index": "transmutation",
   "name": "Transmutation",
   "url": "/api/magic-schools/transmutation"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/regenerate"
 },
 {
  "index": "remove-curse",
  "name": "Remove Curse",
  "desc": [
   "At your touch, all curses affecting one creature or object end. If the object is a cursed magic item, its curse remains, but the spell breaks its owner's attunement to the object so it can be removed or discarded."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 action",
  "level": 3,
  "school": {
   "index": "abjuration",
   "name": "Abjuration",
   "url": "/api/magic-schools/abjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "paladin",
    "name": "Paladin",
    "url": "/api/classes/paladin"
   },
   {
    "index": "warlock",
    "name": "Warlock",
    "url": "/api/classes/warlock"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/remove-curse"
 },
 {
  "index": "resistance",
  "name": "Resistance",
  "desc": [
   "You touch one willing creature. Once before the spell ends, the target can roll a d4 and add the number rolled to one saving throw of its choice. It can roll the die before or after making the saving throw. The spell then ends."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A miniature cloak.",
  "ritual": false,
  "duration": "Up to 1 minute",
  "concentration": true,
  "casting_time": "1 action",
  "level": 0,
  "school": {
   "index": "abjuration",
   "name": "Abjuration",
   "url": "/api/magic-schools/abjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/resistance"
 },
 {
  "index": "resurrection",
  "name": "Resurrection",
  "desc": [
   "You touch a dead creature that has been dead for no more than a century, that didn't die of old age, and that isn't undead. If its soul is free and willing, the target returns to life with all its hit points.",
   "This spell neutralizes any poisons and cures normal diseases afflicting the creature when it died. It doesn't, however, remove magical diseases, curses, and the like; if such effects aren't removed prior to casting the spell, they afflict the target on its return to life.",
   "This spell closes all mortal wounds and restores any missing body parts.",
   "Coming back from the dead is an ordeal. The target takes a -4 penalty to all attack rolls, saving throws, and ability checks. Every time the target finishes a long rest, the penalty is reduced by 1 until it disappears.",
   "Casting this spell to restore life to a creature that has been dead for one year or longer taxes you greatly. Until you finish a long rest, you can't cast spells again, and you have disadvantage on all attack rolls, ability checks, and saving throws."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A diamond worth at least 1,000gp, which the spell consumes.",
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 hour",
  "level": 7,
  "school": {
   "index": "necromancy",
   "name": "Necromancy",
   "url": "/api/magic-schools/necromancy"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/resurrection"
 },
 {
  "index": "revivify",
  "name": "Revivify",
  "desc": [
   "You touch a creature that has died within the last minute. That creature returns to life with 1 hit point. This spell can't return to life a creature that has died of old age, nor can it restore any missing body parts."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "Diamonds worth 300gp, which the spell consumes.",
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 action",
  "level": 3,
  "school": {
   "index": "conjuration",
   "name": "Conjuration",
   "url": "/api/magic-schools/conjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "paladin",
    "name": "Paladin",
    "url": "/api/classes/paladin"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   },
   {
    "index": "life",
    "name": "Life",
    "url": "/api/subclasses/life"
   }
  ],
  "url": "/api/spells/revivify"
 },
 {
  "index": "sacred-flame",
  "name": "Sacred Flame",
  "desc": [
   "Flame-like radiance descends on a creature that you can see within range. The target must succeed on a dexterity saving throw or take 1d8 radiant damage. The target gains no benefit from cover for this saving throw.",
   "The spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8)."
  ],
  "range": "60 feet",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 action",
  "level": 0,
  "attack_type": "ranged",
  "damage": {
   "damage_type": {
    "index": "radiant",
    "name": "Radiant",
    "url": "/api/damage-types/radiant"
   },
   "damage_at_character_level": {
    "1": "1d8",
    "5": "2d8",
    "11": "3d8",
    "17": "4d8"
   }
  },
  "dc": {
   "dc_type": {
    "index": "dex",
    "name": "DEX",
    "url": "/api/ability-scores/dex"
   },
   "dc_success": "none"
  },
  "school": {
   "index": "evocation",
   "name": "Evocation",
   "url": "/api/magic-schools/evocation"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/sacred-flame"
 },
 {
  "index": "sanctuary",
  "name": "Sanctuary",
  "desc": [
   "You ward a creature within range against attack. Until the spell ends, any creature who targets the warded creature with an attack or a harmful spell must first make a wisdom saving throw. On a failed save, the creature must choose a new target or lose the attack or spell. This spell doesn't protect the warded creature from area effects, such as the explosion of a fireball.",
   "If the warded creature makes an attack or casts a spell that affects an enemy creature, this spell ends."
  ],
  "range": "30 feet",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A small silver mirror.",
  "ritual": false,
  "duration": "1 minute",
  "concentration": false,
  "casting_time": "1 bonus action",
  "level": 1,
  "school": {
   "index": "abjuration",
   "name": "Abjuration",
   "url": "/api/magic-schools/abjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   },
   {
    "index": "devotion",
    "name": "Devotion",
    "url": "/api/subclasses/devotion"
   }
  ],
  "url": "/api/spells/sanctuary"
 },
 {
  "index": "scrying",
  "name": "Scrying",
  "desc": [
   "You can see and hear a particular creature you choose that is on the same plane of existence as you. The target must make a wisdom saving throw, which is modified by how well you know the target and the sort of physical connection you have to it. If a target knows you're casting this spell, it can fail the saving throw voluntarily if it wants to be observed.",
   "Knowledge & Save Modifier",
   "Secondhand (you have heard of the target) +5",
   "Firsthand (you have met the target) +0",
   "Familiar (you know the target well) -5",
   "Connection & Save Modifier",
   "Likeness or picture -2",
   "Possession or garment -4",
   "Body part, lock of hair, bit of nail, or the like -10",
   "On a successful save, the target isn't affected, and you can't use this spell against it again for 24 hours.",
   "On a failed save, the spell creates an invisible sensor within 10 feet of the target. You can see and hear through the sensor as if you were there. The sensor moves with the target, remaining within 10 feet of it for the duration. A creature that can see invisible objects sees the sensor as a luminous orb about the size of your fist.",
   "Instead of targeting a creature, you can choose a location you have seen before as the target of this spell. When you do, the sensor appears at that location and doesn't move."
  ],
  "range": "Self",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A focus worth at least 1,000 gp, such as a crystal ball, a silver mirror, or a font filled with holy water.",
  "ritual": false,
  "duration": "Up to 10 minutes",
  "concentration": true,
  "casting_time": "10 minutes",
  "level": 5,
  "dc": {
   "dc_type": {
    "index": "wis",
    "name": "WIS",
    "url": "/api/ability-scores/wis"
   },
   "dc_success": "none"
  },
  "school": {
   "index": "divination",
   "name": "Divination",
   "url": "/api/magic-schools/divination"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "warlock",
    "name": "Warlock",
    "url": "/api/classes/warlock"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [
   {
    "index": "land",
    "name": "Land",
    "url": "/api/subclasses/land"
   }
  ],
  "url": "/api/spells/scrying"
 },
 {
  "index": "sending",
  "name": "Sending",
  "desc": [
   "You send a short message of twenty-five words or less to a creature with which you are familiar. The creature hears the message in its mind, recognizes you as the sender if it knows you, and can answer in a like manner immediately. The spell enables creatures with Intelligence scores of at least 1 to understand the meaning of your message.",
   "You can send the message across any distance and even to other planes of existence, but if the target is on a different plane than you, there is a 5 percent chance that the message doesn't arrive."
  ],
  "range": "Unlimited",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A short piece of fine copper wire.",
  "ritual": false,
  "duration": "1 round",
  "concentration": false,
  "casting_time": "1 action",
  "level": 3,
  "school": {
   "index": "evocation",
   "name": "Evocation",
   "url": "/api/magic-schools/evocation"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/sending"
 },
 {
  "index": "shield-of-faith",
  "name": "Shield of Faith",
  "desc": [
   "A shimmering field appears and surrounds a creature of your choice within range, granting it a +2 bonus to AC for the duration."
  ],
  "range": "60 feet",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A small parchment with a bit of holy text written on it.",
  "ritual": false,
  "duration": "Up to 10 minutes",
  "concentration": true,
  "casting_time": "1 bonus action",
  "level": 1,
  "school": {
   "index": "abjuration",
   "name": "Abjuration",
   "url": "/api/magic-schools/abjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "paladin",
    "name": "Paladin",
    "url": "/api/classes/paladin"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/shield-of-faith"
 },
 {
  "index": "silence",
  "name": "Silence",
  "desc": [
   "For the duration, no sound can be created within or pass through a 20-foot-radius sphere centered on a point you choose within range. Any creature or object entirely inside the sphere is immune to thunder damage, and creatures are deafened while entirely inside it.",
   "Casting a spell that includes a verbal component is impossible there."
  ],
  "range": "120 feet",
  "components": [
   "V",
   "S"
  ],
  "ritual": true,
  "duration": "Up to 10 minutes",
  "concentration": true,
  "casting_time": "1 action",
  "level": 2,
  "area_of_effect": {
   "type": "sphere",
   "size": 20
  },
  "school": {
   "index": "illusion",
   "name": "Illusion",
   "url": "/api/magic-schools/illusion"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "ranger",
    "name": "Ranger",
    "url": "/api/classes/ranger"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   },
   {
    "index": "land",
    "name": "Land",
    "url": "/api/subclasses/land"
   }
  ],
  "url": "/api/spells/silence"
 },
 {
  "index": "spare-the-dying",
  "name": "Spare the Dying",
  "desc": [
   "You touch a living creature that has 0 hit points. The creature becomes stable. This spell has no effect on undead or constructs."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 action",
  "level": 0,
  "school": {
   "index": "necromancy",
   "name": "Necromancy",
   "url": "/api/magic-schools/necromancy"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/spare-the-dying"
 },
 {
  "index": "speak-with-dead",
  "name": "Speak with Dead",
  "desc": [
   "You grant the semblance of life and intelligence to a corpse of your choice within range, allowing it to answer the questions you pose. The corpse must still have a mouth and can't be undead. The spell fails if the corpse was the target of this spell within the last 10 days.",
   "Until the spell ends, you can ask the corpse up to five questions. The corpse knows only what it knew in life, including the languages it knew. Answers are usually brief, cryptic, or repetitive, and the corpse is under no compulsion to offer a truthful answer if you are hostile to it or it recognizes you as an enemy. This spell doesn't return the creature's soul to its body, only its animating spirit. Thus, the corpse can't learn new information, doesn't comprehend anything that has happened since it died, and can't speculate about future events."
  ],
  "range": "10 feet",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "Burning incense.",
  "ritual": false,
  "duration": "10 minutes",
  "concentration": false,
  "casting_time": "1 action",
  "level": 3,
  "school": {
   "index": "necromancy",
   "name": "Necromancy",
   "url": "/api/magic-schools/necromancy"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/speak-with-dead"
 },
 {
  "index": "spirit-guardians",
  "name": "Spirit Guardians",
  "desc": [
   "You call forth spirits to protect you. They flit around you to a distance of 15 feet for the duration. If you are good or neutral, their spectral form appears angelic or fey (your choice). If you are evil, they appear fiendish.",
   "When you cast this spell, you can designate any number of creatures you can see to be unaffected by it. An affected creature's speed is halved in the area, and when the creature enters the area for the first time on a turn or starts its turn there, it must make a wisdom saving throw. On a failed save, the creature takes 3d8 radiant damage (if you are good or neutral) or 3d8 necrotic damage (if you are evil). On a successful save, the creature takes half as much damage."
  ],
  "higher_level": [
   "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d8 for each slot level above 3rd."
  ],
  "range": "Self",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A holy symbol.",
  "ritual": false,
  "duration": "Up to 10 minutes",
  "concentration": true,
  "casting_time": "1 action",
  "level": 3,
  "school": {
   "index": "conjuration",
   "name": "Conjuration",
   "url": "/api/magic-schools/conjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/spirit-guardians"
 },
 {
  "index": "spiritual-weapon",
  "name": "Spiritual Weapon",
  "desc": [
   "You create a floating, spectral weapon within range that lasts for the duration or until you cast this spell again. When you cast the spell, you can make a melee spell attack against a creature within 5 feet of the weapon. On a hit, the target takes force damage equal to 1d8 + your spellcasting ability modifier.",
   "As a bonus action on your turn, you can move the weapon up to 20 feet and repeat the attack against a creature within 5 feet of it.",
   "The weapon can take whatever form you choose. Clerics of deities who are associated with a particular weapon (as St. Cuthbert is known for his mace and Thor for his hammer) make this spell's effect resemble that weapon."
  ],
  "higher_level": [
   "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for every two slot levels above the 2nd."
  ],
  "range": "60 feet",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "1 minute",
  "concentration": false,
  "casting_time": "1 bonus action",
  "level": 2,
  "attack_type": "melee",
  "damage": {
   "damage_type": {
    "index": "force",
    "name": "Force",
    "url": "/api/damage-types/force"
   },
   "damage_at_slot_level": {
    "2": "1d8 + MOD",
    "3": "1d8 + MOD",
    "4": "2d8 + MOD",
    "5": "2d8 + MOD",
    "6": "3d8 + MOD",
    "7": "3d8 + MOD",
    "8": "4d8 + MOD",
    "9": "4d8 + MOD"
   }
  },
  "school": {
   "index": "evocation",
   "name": "Evocation",
   "url": "/api/magic-schools/evocation"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   },
   {
    "index": "life",
    "name": "Life",
    "url": "/api/subclasses/life"
   }
  ],
  "url": "/api/spells/spiritual-weapon"
 },
 {
  "index": "stone-shape",
  "name": "Stone Shape",
  "desc": [
   "You touch a stone object of Medium size or smaller or a section of stone no more than 5 feet in any dimension and form it into any shape that suits your purpose. So, for example, you could shape a large rock into a weapon, idol, or coffer, or make a small passage through a wall, as long as the wall is less than 5 feet thick. You could also shape a stone door or its frame to seal the door shut. The object you create can have up to two hinges and a latch, but finer mechanical detail isn't possible."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "Soft clay, to be crudely worked into the desired shape for the stone object.",
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 action",
  "level": 4,
  "school": {
   "index": "transmutation",
   "name": "Transmutation",
   "url": "/api/magic-schools/transmutation"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [
   {
    "index": "land",
    "name": "Land",
    "url": "/api/subclasses/land"
   }
  ],
  "url": "/api/spells/stone-shape"
 },
 {
  "index": "symbol",
  "name": "Symbol",
  "desc": [
   "When you cast this spell, you inscribe a harmful glyph either on a surface (such as a section of floor, a wall, or a table) or within an object that can be closed to conceal the glyph (such as a book, a scroll, or a treasure chest). If you choose a surface, the glyph can cover an area of the surface no larger than 10 feet in diameter. If you choose an object, that object must remain in its place; if the object is moved more than 10 feet from where you cast this spell, the glyph is broken, and the spell ends without being triggered.",
   "The glyph is nearly invisible, requiring an Intelligence (Investigation) check against your spell save DC to find it.",
   "You decide what triggers the glyph when you cast the spell. For glyphs inscribed on a surface, the most typical triggers include touching or stepping on the glyph, removing another object covering it, approaching within a certain distance of it, or manipulating the object that holds it. For glyphs inscribed within an object, the most common triggers are opening the object, approaching within a certain distance of it, or seeing or reading the glyph.",
   "You can further refine the trigger so the spell is activated only under certain circumstances or according to a creature's physical characteristics (such as height or weight), or physical kind (for example, the ward could be set to affect hags or shapechangers). You can also specify creatures that don't trigger the glyph, such as those who say a certain password.",
   "When you inscribe the glyph, choose one of the options below for its effect. Once triggered, the glyph glows, filling a 60-foot-radius sphere with dim light for 10 minutes, after which time the spell ends. Each creature in the sphere when the glyph activates is targeted by its effect, as is a creature that enters the sphere for the first time on a turn or ends its turn there.",
   "Death.",
   "Each target must make a constitution saving throw, taking 10d 10 necrotic damage on a failed save, or half as much damage on a successful save.",
   "Discord.",
   "Each target must make a constitution saving throw. On a failed save, a target bickers and argues with other creatures for 1 minute. During this time, it is incapable of meaningful communication and has disadvantage on attack rolls and ability checks.",
   "Fear.",
   "Each target must make a wisdom saving throw and becomes frightened for 1 minute on a failed save. While frightened, the target drops whatever it is holding and must move at least 30 feet away from the glyph on each of its turns, if able.",
   "Hopelessness.",
   "Each target must make a charisma saving throw. On a failed save, the target is overwhelmed with despair for 1 minute. During this time, it can't attack or target any creature with harmful abilities, spells, or other magical effects.",
   "Insanity.",
   "Each target must make an intelligence saving throw. On a failed save, the target is driven insane for 1 minute. An insane creature can't take actions, can't understand what other creatures say, can't read, and speaks only in gibberish. The DM controls its movement, which is erratic.",
   "Pain.",
   "Each target must make a constitution saving throw and becomes incapacitated with excruciating pain for 1 minute on a failed save.",
   "Sleep.",
   "Each target must make a wisdom saving throw and falls unconscious for 10 minutes on a failed save. A creature awakens if it takes damage or if someone uses an action to shake or slap it awake.",
   "Stunning.",
   "Each target must make a wisdom saving throw and becomes stunned for 1 minute on a failed save."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "Mercury, phosphorus, and powdered diamond and opal with a total value of at least 1,000 gp, which the spell consumes.",
  "ritual": false,
  "duration": "Until dispelled",
  "concentration": false,
  "casting_time": "1 minute",
  "level": 7,
  "area_of_effect": {
   "type": "cube",
   "size": 10
  },
  "school": {
   "index": "abjuration",
   "name": "Abjuration",
   "url": "/api/magic-schools/abjuration"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/symbol"
 },
 {
  "index": "thaumaturgy",
  "name": "Thaumaturgy",
  "desc": [
   "You manifest a minor wonder, a sign of supernatural power, within range. You create one of the following magical effects within range.",
   "- Your voice booms up to three times as loud as normal for 1 minute.",
   "- You cause flames to flicker, brighten, dim, or change color for 1 minute.",
   "- You cause harmless tremors in the ground for 1 minute.",
   "- You create an instantaneous sound that originates from a point of your choice within range, such as a rumble of thunder, the cry of a raven, or ominous whispers.",
   "- You instantaneously cause an unlocked door or window to fly open or slam shut.",
   "- You alter the appearance of your eyes for 1 minute.",
   "If you cast this spell multiple times, you can have up to three of its 1-minute effects active at a time, and you can dismiss such an effect as an action."
  ],
  "range": "30 feet",
  "components": [
   "V"
  ],
  "ritual": false,
  "duration": "1 minute",
  "concentration": false,
  "casting_time": "1 action",
  "level": 0,
  "school": {
   "index": "transmutation",
   "name": "Transmutation",
   "url": "/api/magic-schools/transmutation"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/thaumaturgy"
 },
 {
  "index": "tongues",
  "name": "Tongues",
  "desc": [
   "This spell grants the creature you touch the ability to understand any spoken language it hears. Moreover, when the target speaks, any creature that knows at least one language and can hear the target understands what it says."
  ],
  "range": "Touch",
  "components": [
   "V",
   "M"
  ],
  "material": "A small clay model of a ziggurat.",
  "ritual": false,
  "duration": "1 hour",
  "concentration": false,
  "casting_time": "1 action",
  "level": 3,
  "school": {
   "index": "divination",
   "name": "Divination",
   "url": "/api/magic-schools/divination"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "sorcerer",
    "name": "Sorcerer",
    "url": "/api/classes/sorcerer"
   },
   {
    "index": "warlock",
    "name": "Warlock",
    "url": "/api/classes/warlock"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/tongues"
 },
 {
  "index": "true-resurrection",
  "name": "True Resurrection",
  "desc": [
   "You touch a creature that has been dead for no longer than 200 years and that died for any reason except old age. If the creature's soul is free and willing, the creature is restored to life with all its hit points.",
   "This spell closes all wounds, neutralizes any poison, cures all diseases, and lifts any curses affecting the creature when it died. The spell replaces damaged or missing organs and limbs.",
   "The spell can even provide a new body if the original no longer exists, in which case you must speak the creature's name. The creature then appears in an unoccupied space you choose within 10 feet of you."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A sprinkle of holy water and diamonds worth at least 25,000gp, which the spell consumes.",
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 hour",
  "level": 9,
  "school": {
   "index": "necromancy",
   "name": "Necromancy",
   "url": "/api/magic-schools/necromancy"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/true-resurrection"
 },
 {
  "index": "true-seeing",
  "name": "True Seeing",
  "desc": [
   "This spell gives the willing creature you touch the ability to see things as they actually are. For the duration, the creature has truesight, notices secret doors hidden by magic, and can see into the Ethereal Plane, all out to a range of 120 feet."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "An ointment for the eyes that costs 25gp; is made from mushroom powder, saffron, and fat; and is consumed by the spell.",
  "ritual": false,
  "duration": "1 hour",
  "concentration": false,
  "casting_time": "1 action",
  "level": 6,
  "school": {
   "index": "divination",
   "name": "Divination",
   "url": "/api/magic-schools/divination"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "sorcerer",
    "name": "Sorcerer",
    "url": "/api/classes/sorcerer"
   },
   {
    "index": "warlock",
    "name": "Warlock",
    "url": "/api/classes/warlock"
   },
   {
    "index": "wizard",
    "name": "Wizard",
    "url": "/api/classes/wizard"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/true-seeing"
 },
 {
  "index": "warding-bond",
  "name": "Warding Bond",
  "desc": [
   "This spell wards a willing creature you touch and creates a mystic connection between you and the target until the spell ends. While the target is within 60 feet of you, it gains a +1 bonus to AC and saving throws, and it has resistance to all damage. Also, each time it takes damage, you take the same amount of damage.",
   "The spell ends if you drop to 0 hit points or if you and the target become separated by more than 60 feet.",
   "It also ends if the spell is cast again on either of the connected creatures. You can also dismiss the spell as an action."
  ],
  "range": "Touch",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A pair of platinum rings worth at least 50gp each, which you and the target must wear for the duration.",
  "ritual": false,
  "duration": "1 hour",
  "concentration": false,
  "casting_time": "1 action",
  "level": 2,
  "school": {
   "index": "abjuration",
   "name": "Abjuration",
   "url": "/api/magic-schools/abjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   }
  ],
  "url": "/api/spells/warding-bond"
 },
 {
  "index": "water-walk",
  "name": "Water Walk",
  "desc": [
   "This spell grants the ability to move across any liquid surface--such as water, acid, mud, snow, quicksand, or lava--as if it were harmless solid ground (creatures crossing molten lava can still take damage from the heat). Up to ten willing creatures you can see within range gain this ability for the duration.",
   "If you target a creature submerged in a liquid, the spell carries the target to the surface of the liquid at a rate of 60 feet per round."
  ],
  "range": "30 feet",
  "components": [
   "V",
   "S",
   "M"
  ],
  "material": "A piece of cork.",
  "ritual": true,
  "duration": "1 hour",
  "concentration": false,
  "casting_time": "1 action",
  "level": 3,
  "school": {
   "index": "transmutation",
   "name": "Transmutation",
   "url": "/api/magic-schools/transmutation"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "druid",
    "name": "Druid",
    "url": "/api/classes/druid"
   },
   {
    "index": "ranger",
    "name": "Ranger",
    "url": "/api/classes/ranger"
   },
   {
    "index": "sorcerer",
    "name": "Sorcerer",
    "url": "/api/classes/sorcerer"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   },
   {
    "index": "land",
    "name": "Land",
    "url": "/api/subclasses/land"
   }
  ],
  "url": "/api/spells/water-walk"
 },
 {
  "index": "word-of-recall",
  "name": "Word of Recall",
  "desc": [
   "You and up to five willing creatures within 5 feet of you instantly teleport to a previously designated sanctuary. You and any creatures that teleport with you appear in the nearest unoccupied space to the spot you designated when you prepared your sanctuary (see below). If you cast this spell without first preparing a sanctuary, the spell has no effect.",
   "You must designate a sanctuary by casting this spell within a location, such as a temple, dedicated to or strongly linked to your deity. If you attempt to cast the spell in this manner in an area that isn't dedicated to your deity, the spell has no effect."
  ],
  "range": "5 feet",
  "components": [
   "V"
  ],
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 action",
  "level": 6,
  "area_of_effect": {
   "type": "sphere",
   "size": 5
  },
  "school": {
   "index": "conjuration",
   "name": "Conjuration",
   "url": "/api/magic-schools/conjuration"
  },
  "classes": [
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   }
  ],
  "subclasses": [],
  "url": "/api/spells/word-of-recall"
 },
 {
  "index": "zone-of-truth",
  "name": "Zone of Truth",
  "desc": [
   "You create a magical zone that guards against deception in a 15-foot-radius sphere centered on a point of your choice within range. Until the spell ends, a creature that enters the spell's area for the first time on a turn or starts its turn there must make a Charisma saving throw. On a failed save, a creature can't speak a deliberate lie while in the radius. You know whether each creature succeeds or fails on its saving throw.",
   "An affected creature is aware of the fate and can avoid answering questions she would normally have responded with a lie. Such a creature can remain evasive in his answers as they remain within the limits of truth."
  ],
  "range": "60 feet",
  "components": [
   "V",
   "S"
  ],
  "ritual": false,
  "duration": "10 minutes",
  "concentration": false,
  "casting_time": "1 action",
  "level": 2,
  "area_of_effect": {
   "type": "sphere",
   "size": 15
  },
  "school": {
   "index": "enchantment",
   "name": "Enchantment",
   "url": "/api/magic-schools/enchantment"
  },
  "classes": [
   {
    "index": "bard",
    "name": "Bard",
    "url": "/api/classes/bard"
   },
   {
    "index": "cleric",
    "name": "Cleric",
    "url": "/api/classes/cleric"
   },
   {
    "index": "paladin",
    "name": "Paladin",
    "url": "/api/classes/paladin"
   }
  ],
  "subclasses": [
   {
    "index": "lore",
    "name": "Lore",
    "url": "/api/subclasses/lore"
   },
   {
    "index": "devotion",
    "name": "Devotion",
    "url": "/api/subclasses/devotion"
   }
  ],
  "url": "/api/spells/zone-of-truth"
 }
]